[
  {
    "soru numarası": 1,
    "soru cümlesi": "8 bit değerinde bitmap ve RGB görüntüleri destekleyen, Truevision ekran donanımı için tasarlanmış olan dosya formatı aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Pixar",
      "B) PNG",
      "C) BMP",
      "D) Targa",
      "E) TIFF"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "TARGA:8 bit değerinde bitmap ve RGB görüntüleri destekleyen, Truevision ekran donanımı için tasarlanmış bir dosya türüdür. Farklı uygulamalarda da çalışmaktadır."
  },
  {
    "soru numarası": 2,
    "soru cümlesi": "Bir metne yönelik punto, yazı stili, karakterler arası uzaklık, satır aralığı veya genişlik gibi ayarların bulunduğu panel aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Paragraf Stili",
      "B) Karakter Stili",
      "C) Yazı Stili",
      "D) Metin Stilleri",
      "E) Kayıtlı Stiller"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Metinlerin; yazı stili, punto, karakterler arası uzaklık, satır aralığı veya genişlik gibi karakterlerine yönelik yapılan ayarların bulunduğu panele karakter paneli denilmektedir."
  },
  {
    "soru numarası": 3,
    "soru cümlesi": "Photoshop programı eylemler paneli arasında aşağıdakilerden hangisi yer almaz?",
    "seçenekler": [
      "A) Eylem Kümesi",
      "B) Eylem",
      "C) Kaydedilmiş Komutlar",
      "D) Eklenen Komut",
      "E) Kaynak"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Eylem kümesi B. Eylem C. Kaydedilmiş komutlar D. Eklenen komut E. Mod kontrolü (açık ve kapalı arasında geçiş yapar)"
  },
  {
    "soru numarası": 4,
    "soru cümlesi": "Bir arka plana renk verebilmek için “Solid Renk” özelliğinin seçildiği menüye ulaşılan panel aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Özellikler",
      "B) Yollar",
      "C) Karakter",
      "D) Katmanlar",
      "E) Kanallar"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Katmana renk verebilmek için Katmanlar panelinde Şekil 14.1‘de gösterilen 1 nolu butona sağ tıklanır ve Solid Renk menüsü seçilir ve açılan renk kartelasından siyah tonda bir renk (#191919) seçilir."
  },
  {
    "soru numarası": 5,
    "soru cümlesi": "Photoshop programı filtre galerisi kullanılarak üst üste filtre eklemek için yapılması gereken aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Eklenmek istenen filtre doğrudan seçilmelidir.",
      "B) Yeni efekt katmanı eklenmelidir.",
      "C) Shift tuşuna basılarak birden fazla filtre seçilmelidir.",
      "D) Ctrl tuşuna basılarak birden fazla filtre seçilmelidir.",
      "E) Shift+Ctrl kısa yolu kullanılmalıdır."
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": ""
  },
  {
    "soru numarası": 6,
    "soru cümlesi": "Photoshop programında zaman çizelgesinde seçili olan karenin kopyalanması sağlayan komut aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Kare sil",
      "B) Animasyonu sil",
      "C) Kareyi yapıştır",
      "D) Kareyi kopyala",
      "E) Tüm kareleri seç"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Kareyi Kopyala, seçeneği ile zaman çizelgesinde seçili olan karenin kopyalanması sağlanır."
  },
  {
    "soru numarası": 7,
    "soru cümlesi": "Bir metnin kenar piksellerinin kısmen doldurularak; keskin, net, kuvvetli veya düzgün yazı oluşturulmasını sağlayan işlem aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Kenar Yumuşatma",
      "B) Piksel Düzenleme",
      "C) Yazı Keskinleştir",
      "D) Piksel Doldurma",
      "E) Yazı Oluşturma"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Bir metnin kenar piksellerinin kısmen doldurularak; keskin, net, kuvvetli veya düzgün yazı oluşturulmasına kenar yumuşatma işlemi denilmektedir."
  },
  {
    "soru numarası": 8,
    "soru cümlesi": "Photoshop programında birden çok görsel üzerinde tek seferde uygulamak için işlem yapmayı sağlayan komut seçeneği aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Dosya / İçe Aktar",
      "B) Katman/ Katmanları Grupla",
      "C) Dosya / Otomatikleştir / Toplu İş",
      "D) Seç / Katmanları Yalıt",
      "E) Görüntü / Görüntü Döndürme"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Var olan veya oluşturan bir eylemi birden çok görsel üzerinde tek seferde uygulamak için gösterildiği üzere Dosya / Otomatikleştir / Toplu İş seçeneği kullanılmaktadır. Toplu iş komutu bir eylemin otomatik ve toplu olarak bir dosya grubuna uygulanması sağlar."
  },
  {
    "soru numarası": 9,
    "soru cümlesi": "Adobe Photoshop CC 2018 programında dikdörtgen, oval, tek satır ve tek sütun seçimleri yapmaya olanak sağlayan araç aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Kement araçları",
      "B) İşaretleme araçları",
      "C) Hızlı seçim araçları",
      "D) Kırpma araçları",
      "E) Dilimleme araçları"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": ""
  },
  {
    "soru numarası": 10,
    "soru cümlesi": "Dışa aktarılacak olan resmin kaydedilirken en yüksek oranda ölçeklendirme yapılacağı değer aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) %150",
      "B) %200",
      "C) %300",
      "D) %400",
      "E) %500"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "11. ünite 7. sayfada ki Şekil 11.7. de yer almaktadır."
  },
  {
    "soru numarası": 11,
    "soru cümlesi": "Boyutlandırma yapılırken, resmin eni ve boyunun karşı kenara göre otomatik olarak büyüyüp ve küçülmesini sağlayan klavye tuşu ya da tuş kombinasyonu aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Ctrl",
      "B) Shift",
      "C) Alt",
      "D) Ctrl+Shift",
      "E) Enter"
    ],
    "doğru cevap indeksi": null,
    "doğru cevap": "",
    "açıklama": ""
  },
  {
    "soru numarası": 12,
    "soru cümlesi": "Genişlik ve yükseklik dâhil görüntünün yazdırıldığındaki fiziksel boyutunu ifade eden resmin boyut özelliği aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Piksel boyutları",
      "B) Görüntü çözünürlüğü",
      "C) Belge boyutu",
      "D) Resmin genişlik değeri",
      "E) Resmin yükseklik değeri"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Belge boyutu: Genişlik ve yükseklik dahil görüntünün yazdırıldığındaki fiziksel boyutudur."
  },
  {
    "soru numarası": 13,
    "soru cümlesi": "Satın alınmak yerine kiralanarak kullanılabilen program aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Adobe Photoshop CC",
      "B) Adobe Photoshop CS6",
      "C) GIMP",
      "D) Corel Draw",
      "E) Adobe Acrobat"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": ""
  },
  {
    "soru numarası": 14,
    "soru cümlesi": "Photoshop programında animasyon oluştururken GIF dosyasının fazla alan kaplamasını engellemek için kullanılan komut aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Tüm Kareleri Seç",
      "B) Git",
      "C) Kareleri ters çevir",
      "D) Her yeni kare için katman oluştur",
      "E) Animasyonu en iyileştir"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Animasyonu En İyileştir, oluşturduğunuz GIF dosyasının fazla alan kaplamasını engellemektedir"
  },
  {
    "soru numarası": 15,
    "soru cümlesi": "Camgöbeği, galibarda, sarı ve siyah renklerini kullanarak görüntülerin oluşmasına fırsat veren renk modu aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) RGB",
      "B) CMYK",
      "C) Lab",
      "D) Bİtmap",
      "E) Çift ton"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "CMYK modu ise Cyan (camgöbeği), Magenta (galibarda), Yellow (sarı) ve Key (siyah) renklerini kullanarak görüntülerin oluşmasına fırsat vermektedir."
  },
  {
    "soru numarası": 16,
    "soru cümlesi": "Görüntü üzerinde bulunan açık tonları beyaza, koyu olan tonları siyaha yakınlaştırarak gri veya renkli görüntülerde yüksek kontrastlı siyah beyaz görüntüler oluşturulmasına yardımcı olan ayarlar paneli ögesi aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Eşik",
      "B) Canlılık",
      "C) Doygunluk",
      "D) Renk tablosu",
      "E) Degrade eşleme"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Eşik özelliği ile görüntü üzerinde bulunan açık tonları beyaza, koyu olan tonları siyaha yakınlaştırarak gri veya renkli görüntülerde yüksek kontrastlı siyah beyaz görüntüler oluşturulmasına yardımcı olur."
  },
  {
    "soru numarası": 17,
    "soru cümlesi": "Photoshop programı filtre galerisi ile ilgili olarak aşağıdakilerden hangisi yanlıştır?",
    "seçenekler": [
      "A) Filtre galerisinde tüm filtreler yer alır.",
      "B) Filtre galerisi kullanılarak üst üste farklı filtreler uygulanabilir.",
      "C) Filtre galerisinde yer alan filtrelerin ayarlamaları yapılabilir.",
      "D) Filtre galerisi aracılığıyla uygulanan filtrenin ön izlemesi yapılabilir.",
      "E) Filtre galerisinde uygulanan filtrenin sırası değiştirilebilir."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": ""
  },
  {
    "soru numarası": 18,
    "soru cümlesi": "Adobe Photoshop CC 2018 programında araçlar panelinde yer alan araç grupları arasında aşağıdakilerden hangisi yer almaz?",
    "seçenekler": [
      "A) Seçim araçları",
      "B) Rötuş araçları",
      "C) Kayıt araçları",
      "D) Boyama araçları",
      "E) Çizme ve yazma araçları"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "3"
  },
  {
    "soru numarası": 19,
    "soru cümlesi": "Görüntüdeki diğer tüm renkleri oluşturmak için çeşitli miktarlarda birleştirilen renkler kümesine ne ad verilir?",
    "seçenekler": [
      "A) Çözünürlük",
      "B) Renk modları",
      "C) Bulanıklık",
      "D) Bitmap",
      "E) Piksel"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Renk modu, görüntüdeki diğer tüm renkleri oluşturmak için çeşitli miktarlarda birleştirilen renkler kümesine verilen isimdir."
  },
  {
    "soru numarası": 20,
    "soru cümlesi": "Kılavuz çizgilerinin tümünün birden temizlenmesi işleminin yer aldığı menü aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Kılavuz",
      "B) Metin",
      "C) Pencere",
      "D) Görünüm",
      "E) Düzenle"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Görselde yer alan yuvarlak resimler için maskeleme işlemi yapılmalıdır (Şekil 14.18). Bunun için istenilen büyüklükte bir Elips çizilir (araçlar çubuğundan). Daha sonra bu Elipsin üzerine Şekil 14.16.b’de yer alan görsel yapıştırılır. Elipsin içinde olmasını isteğimiz kısım yuvarlakla üst üste olmalıdır. Şekil 14.16.b’de yer alan görselin daha üst katmanda olduğunda dikkat edilmelidir. Şekil 14.16.b’nin yer aldığı katmana sağ tıklanır ve “Kırpma Maskesi Oluştur” butonuna tıklanır. Daha sonra Elipsin bulunduğu katman seçiliyken Pencere > Özellikler menüsüne tıklanır. Açılan panelden kontur 5 px olarak ayarlanır. Bu işlem broşürün orta ve sağ kısımlar için de yapıldıktan sonra elde edilen tasarım Şekil 14.18’deki gibidir. Şekil 14.18’de kılavuz çizgileri bulunmamaktadır. Bu çizgiler Görünüm > Kılavuzları Temizle menüsünden yapılmaktadır."
  }
]