[
  {
    "soru numarası": 1,
    "soru cümlesi": "Türkiye Türkçesi hangi lehçenin devamı niteliğindedir?",
    "seçenekler": [
      "A) Kuzeydoğu Türk lehçesi",
      "B) Azerbaycan Türk lehçesi",
      "C) Güneydoğu Türk lehçesi",
      "D) Güneybatı Türk lehçesi",
      "E) Kuzeybatı Türk lehçesi"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Türkiye Türkçesi Güneybatı (Oğuz) Türk lehçelerinin devamı niteliğindedir."
  },
  {
    "soru numarası": 2,
    "soru cümlesi": "Türkçede p, ç, t, k ünsüzleri ünlü ile başlayan bir ek aldıklarında b, c, d, ğ ünsüzlerine dönüşür. Aşağıdakilerden hangisi bu kurala uymaz?",
    "seçenekler": [
      "A) Sokak",
      "B) Yurt",
      "C) Türk",
      "D) Ağaç",
      "E) Dip"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Türk"
  },
  {
    "soru numarası": 3,
    "soru cümlesi": "“Sudan sebeplerle beni terk edemezsin.” cümlesi yüklemin türüne göre aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Sıfat",
      "B) Eylem",
      "C) İsim",
      "D) Zamir",
      "E) Zarf"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Daha önceki ünitelerde öğrendiğimiz gibi Türkçede kelimeler, isimler ve fiiller olarak ikiye ayrılmıştı. Cümlede yüklem görevinde kullanılan kelimenin türüne göre cümleler de “fiil cümlesi” ve “isim cümlesi” olarak iki gruba ayrılmaktadır. [1]"
  },
  {
    "soru numarası": 4,
    "soru cümlesi": "Aşağıdaki cümlelerden hangisi \"\"mi\"\"li soru cümlesine örnektir?",
    "seçenekler": [
      "A) Şu sınav biti miydi rahatız.",
      "B) Şu maçı da aldık mı şampiyonuz.",
      "C) Ellerimden tutiun muydu hiçbir engel aşılmaz değil evladım.",
      "D) Doğum günün 3 Nisan mıydı?",
      "E) Koşabilir mi koşamaz mı bilemiyorum."
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": ""
  },
  {
    "soru numarası": 5,
    "soru cümlesi": "Aşağıdaki cümlelerin hangisinde ögeleri ayırmada yanlışlık yapılmıştır?",
    "seçenekler": [
      "A) Sorulara şöyle bir göz atıp / kitabı / kapaƴ.",
      "B) Buraya kadar geldiğiniz için / teşekkür ederim.",
      "C) Vapurdan / çıkarken / onu / fark etmiştim.",
      "D) Okuldan çıkarken / kitabımı unutiuğumu / bana / Ahmet / söyledi.",
      "E) Biraz daha rahat yaşamak için / çabalıyordu."
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Cümlenin yüklem ile öznenin dışındaki ögeleri; yüklemin anlamını çeşitli yönlerden tamamlayan, tümleyen ögelerdir. Bunlara genel olarak tümleç adı verilir. [4]"
  },
  {
    "soru numarası": 6,
    "soru cümlesi": "Aşağıdakilerden hangisi konuşma ve yazı dili arasındaki farklardan biri değildir?",
    "seçenekler": [
      "A) Konuşma dili günlük hayatia farklılıklar arz ederken yazı dili değişmezdir.",
      "B) Bir ülkede birden fazla yazı buna karşılık tek konuşma dili vardır.",
      "C) Yazı dili konuşma diline göre daha kuralcı bir yapıdadır.",
      "D) Konuşma dili doğal, yazı dili ise yapay bir dildir.",
      "E) Yazı dili konuşma diline göre daha yaygın ve geniş bir kullanım alanına sahiptir."
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": ""
  },
  {
    "soru numarası": 7,
    "soru cümlesi": "Aşağıdakilerin hangisinde soru eki “-mı / -mi” “Sana söylediklerimi yaptın mı sınavı geçersin.” cümlesindekiyle aynı görevde kullanılmıştır?",
    "seçenekler": [
      "A) Sana bir tokat aƴm mı anlarsın ne olduğunu.",
      "B) Çetin mi çetin bir kişiliğe sahipti.",
      "C) Bu iş illa böyle mi bitmeliydi?",
      "D) Reçeteyi doğru uyguladı mı hastalıktan kurtulur.",
      "E) Bunları kimseye anlaƴn mı?"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Sayfa 16 paragraf 3 de yer almaktadır."
  },
  {
    "soru numarası": 8,
    "soru cümlesi": "Aşağıdakilerden hangisinde zıt anlamlı kelimeler bir arada verilmemiştir?",
    "seçenekler": [
      "A) Az-Çok",
      "B) Kolay-Zor",
      "C) İleri-Yukarı",
      "D) İleri-Geri",
      "E) Yakın-Uzak"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "İleri ve yukarı kelimeleri zıt anlamlı değildir."
  },
  {
    "soru numarası": 9,
    "soru cümlesi": "Aşağıdaki cümlelerin hangisinde bir deyim değiştirilerek söylenmiş ve anlam kaybına uğramıştır?",
    "seçenekler": [
      "A) Aklım dün akşamki olaya takıldı.",
      "B) Bu adamı aklım tutmadı.",
      "C) Şu yaramazın pabuç kadar dili var.",
      "D) Bugünkü olaydan sonra ağzına lokma koymadı.",
      "E) Kara gün dostu olarak tanınmıştı."
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Bu adamı aklım tutmadı. (Bu adamı gözüm tutmadı.)"
  },
  {
    "soru numarası": 10,
    "soru cümlesi": "I. Toplumların tarihsel belleğidir. II. Sosyal ve kültürel değerlerin taşıyıcısıdır. III. Birlik ve beraberliğin en temel simgesidir. Dil ile ilgili olarak yukarıdakilerden hangisi ya da hangileri doğrudur?",
    "seçenekler": [
      "A) II ve III",
      "B) Yalnız III",
      "C) I ve III",
      "D) I, II ve III",
      "E) I ve II"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Sayfa 3 paragraf 5 de yer almaktadır."
  },
  {
    "soru numarası": 11,
    "soru cümlesi": "Aşağıdaki ilişki sözlerin hangisi diğerlerinden farklıdır?",
    "seçenekler": [
      "A) İyi saatie olsunlar.",
      "B) Ölülerin ardından kötü söz söylenmez.",
      "C) Yediğin içtiğin senin olsun gezdiğin gördüğün yerleri anlat.",
      "D) Küçüklerin gözlerinden büyüklerin ellerinden öperim.",
      "E) Ayıptır söylemesi."
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Cevap Şıkkı A iken B olarak güncellenmiştir."
  },
  {
    "soru numarası": 12,
    "soru cümlesi": "Bir dilin bilinmeyen bir zamanda kendisinden ayrılan ve yeni bir dil olma yolu tutan koluna ne ad verilir?",
    "seçenekler": [
      "A) Şive",
      "B) Benzeşme",
      "C) Lehçe",
      "D) Genişleme",
      "E) Ağız"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Lehçe: Bir dilin bilinmeyen bir zamanda kendisinden ayrılan ve yeni bir dil olma yolu tutan koludur."
  },
  {
    "soru numarası": 13,
    "soru cümlesi": "Türkler ilk olarak hangi alfabeyi kullanmıştır?",
    "seçenekler": [
      "A) Kiril",
      "B) Göktürk",
      "C) Uygur",
      "D) Arap",
      "E) Soğd"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Göktürk (Köktürk) Alfabesi: Türklerin kullandığı ilk alfabedir. Türkler tarafından tesis edildiği kabul edilmektedir."
  },
  {
    "soru numarası": 14,
    "soru cümlesi": "Aşağıdakilerden hangisi yapısına göre basit bir cümledir?",
    "seçenekler": [
      "A) Lokman Hekim gelse yaram azdırır.",
      "B) Önüne engeller çıkaracaklardır, sen bunlara dayanacaksın.",
      "C) Önce okudu ve sonra anlaƴ.",
      "D) O kadar çalıştı ki sonunda başardı.",
      "E) Çanakkale içinde vurdular beni."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Çanakkale içinde vurdular beni."
  },
  {
    "soru numarası": 15,
    "soru cümlesi": "\"\"Ovada sıralanan arsaların içinde koca koca binalar hızla yükseliyordu.\"\" cümlesinde hangi sözcükte cümle vurgusu vardır?",
    "seçenekler": [
      "A) Hızla",
      "B) Binalar",
      "C) Arsaların içinde",
      "D) Arsaların",
      "E) Koca koca"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Söz içinde, kelime ve kelime gruplarından daha büyük birlik, cümledir. Cümlenin de kendine bütünlük kazandıran bir vurgusu vardır. Buna cümle vurgusu denir. Bu vurgu cümleyi meydana getiren kelime ve kelime gruplarının vurgusundan daha belirlidir. Özel bir amaçla vurgu yapılmıyorsa Türkçede cümle vurgusu yüklem üzerindedir"
  },
  {
    "soru numarası": 16,
    "soru cümlesi": "Aşağıdaki cümlelerin hangisinde ünsüz benzeşmesinin örneği yoktur?",
    "seçenekler": [
      "A) Çoğu zaman bizi etkileyen bir esere duyduğumuz bir hayranlığı çevremizle paylaşmaktan mutluluk duyarız.",
      "B) Abdullah Harmancı'ya (2022) göre öykü yazmak iddiası; öykü yazarlarının metinlerini bilmeyi, tanımayı, okumayı, onların metinleriyle hesaplaşmayı gerektirir.",
      "C) Sen de gitin gelmeyecek şeylerin dünyasına gömüldün. Bir daha dönmen güneşi görmen imkânsızdır.",
      "D) Nefesten yumuşak yağan bu yağmur bir gün dinince aynalar yüzümü tanımaz olur.",
      "E) Teftiş adlı öyküde bürokrasinin bir küçük memurun sırtına yükledikleri üzerinden ironi eşliğinde ele alınışı ustacadır."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "\"\"Abdullah Harmancı'ya (2022) göre öykü yazmak iddiası; öykü yazarlarının metinlerini bilmeyi, tanımayı, okumayı, onların metinleriyle hesaplaşmayı gerektirir.\"\" cümlesinde 'gerektirir' sözcüğünde ünsüz benzeşmesi vardır. \"\"Sen de gitin gelmeyecek şeylerin dünyasına gömüldün. Bir daha dönmen güneşi görmen imkânsızdır.\"\" cümlesinde 'gitin' sözcüğünde ünsüz benzeşmesi vardır. \"\"Nefesten yumuşak yağan bu yağmur bir gün dinince aynalar yüzümü tanımaz olur.\"\" cümlesinde 'nefesten' sözcüğünde ünsüz benzeşmesi vardır. \"\"Çoğu zaman bizi etkileyen bir esere duyduğumuz bir hayranlığı çevremizle paylaşmaktan mutluluk duyarız.\"\" cümlesinde 'paylaşmaktan' sözcüğünde ünsüz benzeşmesi vardır. \"\"Teftiş adlı öyküde bürokrasinin bir küçük memurun sırtına yükledikleri üzerinden ironi eşliğinde ele alınışı ustaca.\"\" cümlesinde ünsüz benzeşmesine örnek olabilecek bir kullanım yoktur."
  },
  {
    "soru numarası": 17,
    "soru cümlesi": "Aşağıdakilerden hangisi yazı dilinin özelliklerinden biri değildir?",
    "seçenekler": [
      "A) Bölgeden bölgeye değişen birtakım farklılıkları vardır.",
      "B) Lehçelerden ve ağızlardan birine göre şekillenir.",
      "C) Kullanım alanı ve etkisi konuşma diline göre daha geniştir.",
      "D) Yapma bir dildir.",
      "E) Bir milletin millet olma sürecine önemli katkılar sunar."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Yazı dili standarƴr. Konuşma dilinde bölgeden bölgeye farklılıklar olabilir."
  },
  {
    "soru numarası": 18,
    "soru cümlesi": "Aşağıdaki cümlelerden hangisinde vurgu ikilemenin üzerindedir?",
    "seçenekler": [
      "A) Yalan yanlış bilgilerle herkesi kandırdılar.",
      "B) Annem apar topar sofrayı hazırladı.",
      "C) Hızlı hızlı yürüyerek bu ıssız yerden geçtik.",
      "D) Birçok arkadaşım abur cubur yiyerek sağlıksız besleniyor.",
      "E) Bu şehrin her yerini adım adım gezdim."
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Sorunun Doğru cevabı E iken C olarak güncellenmiştir."
  },
  {
    "soru numarası": 19,
    "soru cümlesi": "Aşağıdaki dil ailelerinden hangisi yapı bakımından eklemeli dilleri içine alır?",
    "seçenekler": [
      "A) Ural-Altay Dilleri",
      "B) Hami-Sami Dilleri",
      "C) Hint-Avrupa Dilleri",
      "D) Bantu Dilleri",
      "E) Çin-Tibet Dilleri"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Ural-Altay dilleri"
  },
  {
    "soru numarası": 20,
    "soru cümlesi": "Aşağıdaki cümlelerin hangisinde hem atasözü hem de deyim anlamlı kelime kullanılmıştır?",
    "seçenekler": [
      "A) Kafana takma iş işten geçti. Olamayız artık eskisi gibi",
      "B) Dilsiz çağırıp söyler, dilimdeki sözümü",
      "C) Bir sinek bir kartalı salladı, vurdu yere.",
      "D) Sen seni bil sen seni. Sen sıkı tut çeneni.",
      "E) Sen kafaya takma beni. Acı patlıcanı kırağı çalmaz."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "\"\"Sen kafaya takma beni. Acı patlıcanı kırağı çalmaz.\"\" cümlesinde \"\"kafaya takma\"\" ifadesinde deyim, acı patlıcanı kırağı çalmaz cümlesinde ise atasözü kullanılmıştır."
  }
]