[
  {
    "soru numarası": 1,
    "soru cümlesi": "Photoshop programında animasyon oluştururken ekranda o anda görüntülenen karenin yanı sıra o kareden önceki ve sonraki belli sayıdaki karelerin şeffaf bir şekilde görünmesi için kullanılan komut aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Soğan zarlarını etkinleştir",
      "B) Kare atlamaya izin ver",
      "C) Döngüde oynat",
      "D) Anahtar kareler",
      "E) Video görüntüsü oluştur"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 13 Soğan Zarlarını Etkinleştir ekranda o anda görüntülenen karenin yanı sıra o kareden önceki ve sonraki belli sayıdaki karelerin şeffaf bir şekilde görünmesi için kullanılmaktadır."
  },
  {
    "soru numarası": 2,
    "soru cümlesi": "Adobe Photoshop CC 2018 programı ile oluşturulan videolar nereden kaydedilmelidir?",
    "seçenekler": [
      "A) Dosya->Farklı Kaydet->Video",
      "B) Dosya->Efektler",
      "C) Dosya->Dışa Aktar->Web için kaydet",
      "D) Dosya->Dışa Aktar->Video Görüntüsü Oluştur",
      "E) Görünüm->Video"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 13 Video Görüntüsü Oluştur, oluşturulan animasyonun video formatında kaydedilmesini, dışa aktarılmasını sağlar. Bu seçenek tıklandığında gelen pencereden oluşturulacak videonun ekran boyutu, kalite özellikleri, kayıt yeri, kaydedilecek kare aralığı gibi özellikler düzenlenebilir. Oluşturulan video “.mp4” formatında kayıt edilmektedir. Ayrıca oluşturulan video Dosya->Dışa Aktar-> Video Görüntüsü Oluştur menüsünden düzenlemeler yapılarak da kaydedilebilir."
  },
  {
    "soru numarası": 3,
    "soru cümlesi": "Katmanlar panelinde A katmanı, B katmanın üstündedir. Bu durumda aşağıdakilerden hangisi doğrudur?",
    "seçenekler": [
      "A) A katmanı ile B katmanı aynı gruptadır.",
      "B) A katmanı taşındığında B katmanı da taşınır.",
      "C) A katmanına bir çizim yapılırsa B katmanına da yapılır.",
      "D) A katmanı B katmanının önünde gözükür.",
      "E) A katmanı silinmeden B katmanı silinemez."
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite:"
  },
  {
    "soru numarası": 4,
    "soru cümlesi": "Adobe Photoshop CC 2018 programında yer alan araç çubuğuyla ilgili olarak aşağıdakilerden hangisi yanlıştır?",
    "seçenekler": [
      "A) Araç çubuğunu özelleştirmek mümkündür.",
      "B) Fazla kullanılmayan araçlar “Ek Araçlar” bölümüne eklenebilir.",
      "C) Oluşturulan araç çubuğunu kaydetmek için “Hazır Ayarı Kaydet” seçeneğine tıklanır.",
      "D) Varsayılan araç çubuğunu kullanmak için “Varsayılanları Geri Yükle” seçeneğine tıklanır.",
      "E) Önceden oluşturulmuş bir araç çubuğu tekrar kullanılamaz."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 4 1. Araç çubuğunun altında yer alan düğmeye uzun basılır ve Araç Çubuğunu Düzenle seçeneğine tıklanır (Şekil 4.6). 2. Açılan pencerede araç çubukları sürükle bırak tekniğiyle özelleştirilebilir. 3. Fazla kullanılmayan araçlar “Ek Araçlar” bölümüne eklenebilir. 4. Kullanıcın oluşturduğu araç çubuğunu kaydetmek için “Hazır Ayarı Kaydet” seçeneğine tıklanır. 5. Varsayılan araç çubuğunu kullanmak için “Varsayılanları Geri Yükle” seçeneğine tıklanır. 6. Önceden oluşturulmuş bir araç çubuğunu açmak için “Hazır Ayarı Yükle” seçeneğine tıklanır."
  },
  {
    "soru numarası": 5,
    "soru cümlesi": "Bir metni çarpıtma işlemi için aşağıdaki menü sıralamalarından hangisi takip edilmelidir?",
    "seçenekler": [
      "A) Metin > Çarpıtma İşlemi",
      "B) Metin > Paneller > Çarpıt",
      "C) Metin > İşlemler > Çarpıt",
      "D) Metin > Çarpıt",
      "E) Metin > Metni Çarpıt"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 8 Hazırlanan tasarımlarda metnin bütünsel olarak şeklini eğip bükme işlemi metni çarpıtma olarak ele alınmaktadır. Metni çarpıtma işlemlerinin yapılabilmesi için Metin > Metni Çarpıt menüsü seçilir."
  },
  {
    "soru numarası": 6,
    "soru cümlesi": "Adobe Photoshop 2018 CC programında Pencere->Ayarlar panelinin görevi aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Sayfa boyutu",
      "B) Video süresi",
      "C) Yollar",
      "D) Renk ve ton ayarlamaları",
      "E) Program ayarları"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 10 Bu bölümde Adobe Photoshop CC 2018 programında bulunan Ayarlar ve Yollar panelleri detaylı olarak açıklanmıştır. Ayarlar paneli, renk ve ton ayarlamaları için kullanılan araçların bulunduğu bir paneldir. Adobe Photoshop’un önceki sürümlerinde Adjustments veya Ayarlamalar paneli olarak adlandırılan bu panel Adobe Photoshop CC 2018’in Türkçe sürümünde Ayarlar olarak adlandırılmıştır. Eğer programınız içerisinde Ayarlar paneli açık değilse Şekil 10.1 de görüldüğü gibi Pencere > Ayarlar menüsünden görünür hale getirebilirsiniz. Ayarlar paneli içerisinde renk ve ton ayarlamaları için kullanılan araçlar bulunur."
  },
  {
    "soru numarası": 7,
    "soru cümlesi": "Bir metin kutusu dikey olarak yönlendirilmek isteniyorsa aşağıdaki menü sıralamalarından hangisi takip edilmelidir?",
    "seçenekler": [
      "A) Metin > Yönlendirme > Dikey",
      "B) Görünüm > Metin Yönü > Dikey",
      "C) Metin > Yön > Dikey Yönlendir",
      "D) Görünüm > Metin > Yön > Dikey",
      "E) Pencere > Metin > Dikey Yön"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 8 Hazırlanan tasarımlarda metnin akışını, yukardan aşağıya veya soldan sağa sağlamak için yönlendirme işlemi kullanılmaktadır. Yatay yönlendirme yapmak için Metin > Yönlendirme > Yatay; dikey yönlendirme yapmak içinse Metin > Yönlendirme > Dikey menüsü seçilmelidir."
  },
  {
    "soru numarası": 8,
    "soru cümlesi": "Aşağıdakilerden hangisi Photoshop programında resmin çözünürlüğü hakkında doğru bir ifade değildir?",
    "seçenekler": [
      "A) Bir resmin ppi değeri ne kadar küçükse çözünürlüğü yani kalitesi de o kadar yüksektir.",
      "B) Photoshop’ta resimler genelde 300 ppi, 72 ppi veya 96 ppi olarak görüntülenmektedir.",
      "C) Baskı alınacak resimlerde baskı kalitesini artırmak için resmin 300 ppi gibi yüksek çözünürlükte olması gerekir.",
      "D) Photoshop’ta kullanım amacına göre resimlerin çözünürlük ayarlaması yapılabilmektedir.",
      "E) Düşük çözünürlük özelliğindeki bir kamerayla çekilmiş bir resmin çözünürlüğünü Photoshop’ta artırmak işe yaramaz."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 9 Bir resmin ppi değeri ne kadar büyükse çözünürlüğü yani kalitesi de o kadar yüksektir"
  },
  {
    "soru numarası": 9,
    "soru cümlesi": "Aşağıdakilerden hangisi toplu işlemlerin kullanılmasının faydalarından biri değildir?",
    "seçenekler": [
      "A) Görsellerin görüntü kalitesini artırma",
      "B) İşlem süresini azaltma",
      "C) Manuel müdahale ve denetim ile bilgisayar kaynaklarının gereksiz kullanılmasını engelleme",
      "D) Bilgisayarın aşınmasını engelleme",
      "E) Bilgisayar kaynaklarını kullanıcılar ve programlar arasında paylaşma"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 12 • Bilgisayar kaynaklarını kullanıcılar ve programlar arasında paylaşma • İşlem süresini azaltma (Zamandan tasarruf sağlama) • Elle müdahale ve denetim ile bilgisayar kaynaklarının gereksiz kullanılmasını engelleme • Bilgisayarın aşınmasını, tekrar yapılan işlemlerden kaynaklı olarak bilgisayar parçalarının beklenenden daha önce ömrünü tamamlamasını engellemedir."
  },
  {
    "soru numarası": 10,
    "soru cümlesi": "Aşağıdakilerden hangisi Adobe Photoshop programında Filtre kullanımıyla ilgili olarak yanlıştır?",
    "seçenekler": [
      "A) Bitmap biçimindeki ve dizinlenmiş renkte resimlere filtre uygulanamaz.",
      "B) Filtre uygulayabilmek için etkin bir katmanın veya bir seçimin kullanılması gerekmektedir.",
      "C) Bir görüntüye filtre uygularken bilgisayarınızın RAM bellek kapasitesi yetersiz ise hata uyarısı alabilirsiniz.",
      "D) Filtre uygulamaları geri alınamaz.",
      "E) 8 bitlik resimlere tüm filtreler uygulanabilirken, bazı filtreler sadece RGB modundaki resimlere uygulanabilir."
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 7 Uyguladığınız filtreyi beğenmediğiniz durumlarda Düzenle menüsünde yer alan Geri Al komutunu kullanarak veya Ctrl+Z kısa yolunu kullanarak yapılan değişiklikleri geri alabilirsiniz."
  },
  {
    "soru numarası": 11,
    "soru cümlesi": "Aşağıdakilerden hangisi renk psikolojisinin önemini en iyi şekilde açıklar?",
    "seçenekler": [
      "A) En iyi uyum sağlayan renkleri belirlememizi sağlamaktadır.",
      "B) Renkler bireyler üzerinde zihinsel ve duygusal etkiler oluşturmaktadır.",
      "C) Renklerin sınıflandırılmasını sağlamaktadır.",
      "D) RGB ve CMYK renk skalalarının oluşturulmasında etkilidir.",
      "E) Renk çemberinin oluşturulmasında temel alınmaktadır."
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 3 Renk psikolojisi renklerin bireyler üzerinde oluşturduğu zihinsel ve duygusal etkilerdir."
  },
  {
    "soru numarası": 12,
    "soru cümlesi": "Aşağıdakilerden hangisi metin sınırlama kutusu işlemleri arasında yer almaz?",
    "seçenekler": [
      "A) Boyutlandırma",
      "B) Döndürme",
      "C) Eğriltme",
      "D) Yönlendirme",
      "E) Fontu eşleştirme"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 8 Metin sınırlama kutusu işlemleri: Boyutlandırma işlemi, Döndürme işlemi, Eğriltme işlemi, Yönlendirme işlemi, metin çarpıtma işlemi."
  },
  {
    "soru numarası": 13,
    "soru cümlesi": "En yüksek 4 GB dosya boyutuna sahip olabilen ve veri boyutundan dolayı web ortamında çok tercih edilmeyen resim formatı aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) PSD",
      "B) EPS",
      "C) PNG",
      "D) Pixar",
      "E) TIFF"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 11 En yüksek 4 GB dosya boyutuna sahip olabilen bir resim formatıdır."
  },
  {
    "soru numarası": 14,
    "soru cümlesi": "Aşağıdakilerden hangisi resim biçimlerinden biri değildir?",
    "seçenekler": [
      "A) JPG",
      "B) GIF",
      "C) TIFF",
      "D) PDF",
      "E) PNG"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 1"
  },
  {
    "soru numarası": 15,
    "soru cümlesi": "LZW isimli sıkıştırma algoritmasına sahip yalnızca 256 renk destekleyen, çok katmanlı yapılardan oluşabildiği için hareketli görseller hazırlanabilir dosya formatı aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) BMP",
      "B) GIF",
      "C) JPEG",
      "D) Targa",
      "E) TIFF"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 11 GIF: LZW isimli sıkıştırma algoritmasına sahip yalnızca 256 renk destekleyen, çok katmanlı yapılardan oluşabildiği için hareketli görseller hazırlanabilir dosya formatıdır."
  },
  {
    "soru numarası": 16,
    "soru cümlesi": "Photoshop programında yolun bulunduğu kısma renk veya desen ataması yapmak için kullanılan Yollar Paneli komutu aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Yolu çoğalt",
      "B) Yolu sil",
      "C) Seçimi yap",
      "D) Yolu doldur",
      "E) Seçili yoldan yeni 3B"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 10 Yolu Doldur seçeneği seçilen yolun bulunduğu kısma renk veya desen ataması yapmak için kullanılmaktadır."
  },
  {
    "soru numarası": 17,
    "soru cümlesi": "Kartvizit tasarımında milimetre cinsinden en yaygın kullanılan ölçü aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) 20*40",
      "B) 80*50",
      "C) 100*130",
      "D) 150*180",
      "E) 200*250"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 14 Kartvizitlerin standart bir ölçüsü olmamakla birlikte en yaygın olarak 80 mm*50 mm şeklinde tasarlanmaktadır"
  },
  {
    "soru numarası": 18,
    "soru cümlesi": "Aşağıdakilerden hangisi Ayarlar paneli ile yapılan ayarlamaların avantajları arasında yer almaz?",
    "seçenekler": [
      "A) Orijinal görüntü üzerinde değişiklik yapmadığı için istenildiği an görüntünün ilk hâline dönüş yapılabilir.",
      "B) Görsele zarar verici bir düzenleme yapılamaz.",
      "C) Bir görsel üzerinde Ayarlar paneli ile yapılan düzenlemeler başka görsellere kopyala-yapıştır yoluyla uygulanabilir.",
      "D) Ayarlar ile oluşturulan katmanlar gizlenebilir ve saydamlaştırılabilir.",
      "E) Ayarlar panelinde seçilen her öge için tek bir katman oluşturulur."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 10 Ayarlar panelinde seçilen her bir öğe kendisi için ayrı bir katman oluşturduğu için yapılan düzenlemelerinde birbirleriyle karışma ihtimali bulunmamaktadır. Böylelikle istenilen öğe üzerinde değişiklik yapılabilir."
  },
  {
    "soru numarası": 19,
    "soru cümlesi": "Adobe Photoshop kurulumundan önce hangi uygulama kurulmalıdır?",
    "seçenekler": [
      "A) Adobe Creative Cloud",
      "B) Adobe Acrobat",
      "C) Adobe InDesign",
      "D) Adobe Illustrator",
      "E) Image-Pro"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 2 Adobe Photoshop (PS) ücretli bir yazılımdır, ancak ücretsiz denemek için bir aylık süre verilmiştir. Amacınız ne olursa olsun, kurulum adımları kısaca aşağıdaki gibidir. 1. Bilgisayarınıza ücretsiz olan Adobe Creative Cloud uygulamasını kurun. 2. Adobe Creative Cloud uygulamasını Adobe ID bilgileriniz ile açıp Adobe Photoshop (PS) programını indirin ve kurun. 30 günlük deneme süreniz hemen başlayacaktır. 30 gün sonrasında Adobe Creative Cloud açılacak ancak PS açılmayacak ve kiralamanız gerektiğini belirtecektir."
  },
  {
    "soru numarası": 20,
    "soru cümlesi": "Asağıdakilerden hangisi benzer içerikli katmanları hizalamak için kullanılabilir?",
    "seçenekler": [
      "A) Katmanları otomatik hizala",
      "B) Üst tarafı referans alarak hizala",
      "C) Alt tarafı referans alarak hizala",
      "D) Sağ tarafı referans alarak hizala",
      "E) Sol tarafı referans alarak hizala"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 6 Katmanları Otomatik Hizala komutu, katmanları benzer içerik temelinde otomatik olarak hizalayabilir."
  }
]