[
  {
    "soru numarası": 1,
    "soru cümlesi": "Adobe Photoshop programında cetvelleri açmak için kullanılan kısa yol tuş kombinasyonu aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Crtl+A",
      "B) Crtl+C",
      "C) Crtl+K",
      "D) Crtl+R",
      "E) Crtl+S"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 6 Crtl+R"
  },
  {
    "soru numarası": 2,
    "soru cümlesi": "Adobe Illustrator grafik tasarım programı ile ilgili olarak aşağıdakilerden hangisi yanlıştır?",
    "seçenekler": [
      "A) Adobe firmasının vektörel çizimler için geliştirdiği grafik programıdır.",
      "B) Kullanıcılara aylık ya da yıllık bazda kiralanarak sunulmaktadır.",
      "C) Desteklediği dosya biçimi kendi dosya biçimi olan Ai’dir.",
      "D) SVG dosya biçimi de desteklenmektedir.",
      "E) Piksel tabanlı resim işleme editörüdür."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 2 Photoshop’un aksine, vektörel çizim içindir."
  },
  {
    "soru numarası": 3,
    "soru cümlesi": "Photoshop programında var olan ya da oluşturulan bir eylemi birden çok görsel üzerinde tek seferde uygulamak için aşağıdakilerden hangisi kullanılır?",
    "seçenekler": [
      "A) Otomatik toplu işleme",
      "B) Oynat",
      "C) Kaynak",
      "D) Hatalar",
      "E) Hedef"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 12 Otomatik Toplu İşleme: Var olan veya oluşturan bir eylemi birden çok görsel üzerinde tek seferde uygulamak için Toplu İş seçeneği kullanılmaktadır."
  },
  {
    "soru numarası": 4,
    "soru cümlesi": "İnç uzunluk ölçü biriminin santimetre karşılığı aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) 1.5 cm",
      "B) 2.54 cm",
      "C) 3.25 cm",
      "D) 4 cm",
      "E) 5.15 cm"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 6 İnç; uzunluğu 2,54 santimetreye (cm) karşılık gelen İngiliz uzunluk ölçü birimi olarak tanımlanmaktadır."
  },
  {
    "soru numarası": 5,
    "soru cümlesi": "Photoshop programında oluşturulan animasyonun sürekli olarak oynatılmasını sağlayan komut aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Kare atlamaya izin ver.",
      "B) Anahtar kareler.",
      "C) Döngüde oynat.",
      "D) Kareleri dönüştür.",
      "E) Göster."
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Unite: 13 Döngüde Oynat seçeneği oluşturulan animasyonun sürekli olarak oynatılmasını sağlamaktadır."
  },
  {
    "soru numarası": 6,
    "soru cümlesi": "Bir pikselin alabileceği toplam renk sayısının belirlediği değer aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Çözünürlük",
      "B) Piksel",
      "C) Gri tonlamalı renk modu",
      "D) Renk derinliği",
      "E) CMYK renk modu"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 1 Bir pikselin alabileceği toplam renk sayısı renk derinliğini belirler"
  },
  {
    "soru numarası": 7,
    "soru cümlesi": "Aşağıdakilerden hangisi kartvizit, afiş, broşür, logo ve infografik tasarımında dikkat edilmesi gereken unsurlar arasında yer almaz?",
    "seçenekler": [
      "A) Sade ve anlaşılır olmalıdır.",
      "B) Tasarım bütünlüğü sağlanmalıdır.",
      "C) Uyumlu renklerin kullanımına dikkat edilmelidir.",
      "D) Mevcut alan en etkili biçimde kullanılmalıdır.",
      "E) Görselin amacı dışına çıkarak kapsam genişletilmelidir."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 14 Kartvizit, afiş, broşür, logo ve infografik farklı amaçlar için tasarlanan görseller olsa da hepsinin de tasarımında dikkat edilmesi gereken bazı unsurlar şu şekilde sıralanabilir: • Sade ve anlaşılır olmalıdır. • Tasarım bütünlüğü sağlanmalıdır. • Uyumlu renklerin kullanımına dikkat edilmelidir. • Gerekmedikçe yazı ve görsel kullanılmamalıdır. • Mevcut alan en etkili biçimde kullanılmalıdır. • Tasarlanacak görselin kapsam ve amacı net belirlenmelidir. • Görselin kapsam ve amacı dışına çıkmamak için dikkat edilmelidir."
  },
  {
    "soru numarası": 8,
    "soru cümlesi": "Aşağıdakilerden hangisi sıcak ve soğuk renkler arasında yer almaz?",
    "seçenekler": [
      "A) Kırmızı",
      "B) Sarı",
      "C) Mavi",
      "D) Yeşil",
      "E) Pembe"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 3 Kırmızı, sarı ve turuncu sıcak, mavi, yeşil ve mor ise soğuk renklerdir."
  },
  {
    "soru numarası": 9,
    "soru cümlesi": "Aşağıdakilerden hangisi Adobe Photoshop CC 2018 programına ait çalışma panelleri arasında yer almaz?",
    "seçenekler": [
      "A) Araçlar",
      "B) Renk",
      "C) Eğitim",
      "D) Katmanlar",
      "E) Düzen"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 4 Çalışma panelleri: Araçlar paneli, Geçmiş paneli, Renk paneli, Eğitim paneli, Katmanlar paneli, Seçenekler çubuğu"
  },
  {
    "soru numarası": 10,
    "soru cümlesi": "Photoshop programında yolun bulunduğu kısma renk veya desen ataması yapmak için kullanılan Yollar Paneli komutu aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Yolu çoğalt",
      "B) Yolu sil",
      "C) Seçimi yap",
      "D) Yolu doldur",
      "E) Seçili yoldan yeni 3B"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 10 Yolu Doldur seçeneği seçilen yolun bulunduğu kısma renk veya desen ataması yapmak için kullanılmaktadır."
  },
  {
    "soru numarası": 11,
    "soru cümlesi": "Renkler arasındaki ilişkileri anlamada kullanılan bir grafiğe ne ad verilir?",
    "seçenekler": [
      "A) Renk çemberi",
      "B) Renk sınıflandırması",
      "C) Renk şeması",
      "D) Renk uyumu",
      "E) Tamamlayıcı renkler"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 3 Renk çemberi renkler arasındaki ilişkileri anlamada kullanılan bir grafiktir."
  },
  {
    "soru numarası": 12,
    "soru cümlesi": ".............. bir resim içerisinde birbirinden bağımsız çizimlerin saklanabildiği sanal düzlemlerdir. Cümlede boş bırakılan yere aşağıdakilerden hangisi getirilmelidir?",
    "seçenekler": [
      "A) Katman",
      "B) Gölge",
      "C) Kontur",
      "D) Dış ışıma",
      "E) Konum kilidi"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 5 Katman bir resim içerisinde birbirinden bağımsız çizimlerin saklanabildiği sanal düzlemlerdir."
  },
  {
    "soru numarası": 13,
    "soru cümlesi": "Sıkıştırma algoritmasına sahip olmadığı için diğer resim formatlarına kıyasla daha çok yer kaplayan Microsoft firmasına ait dijital resim formatı aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) XLS",
      "B) DOCX",
      "C) PPT",
      "D) BMP",
      "E) SWF"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 11 BMP: Sıkıştırma algoritmasına sahip olmadığı için diğer resim formatlarına kıyasla daha çok yer kaplayan Microsoft firmasına ait dijital bir resim formatıdır."
  },
  {
    "soru numarası": 14,
    "soru cümlesi": "Aşağıdakilerden hangisi grafik tasarım programları arasında yer almaz?",
    "seçenekler": [
      "A) Adobe Photoshop",
      "B) Corel Draw",
      "C) Adobe Illustrator",
      "D) Adobe InDesign",
      "E) Microsoft Windows 10"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 2 Microsoft Windows 10 işletim sistemi yazılımıdır. Adobe Photoshop, Corel Draw, Adobe Illustrator, Adobe InDesign, GIMP birer grafik tasarım programıdır."
  },
  {
    "soru numarası": 15,
    "soru cümlesi": "Kullanıcıların programı kullanırken yapmış oldukları tüm eylemleri gösteren panel aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Araçlar paneli",
      "B) Geçmiş paneli",
      "C) Renk paneli",
      "D) Eğitim paneli",
      "E) Katmanlar paneli"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 4 Geçmiş paneli: Kullanıcıların programı kullanırken yapmış oldukları tüm eylemleri gösteren paneldir."
  },
  {
    "soru numarası": 16,
    "soru cümlesi": "I. Sıvılaştırma II. Ufuk noktası III. Gauss Bulanıklığı IV. Radyal Bulanıklık Yukarıdakilerden hangisi ya da hangileri 16 bitlik resimlere uygulanabilecek filtreler arasında yer alır?",
    "seçenekler": [
      "A) Yalnız I",
      "B) I ve II",
      "C) II ve III",
      "D) III ve IV",
      "E) I, II, III ve IV"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 7 16 bitlik resimlere uygulanabilecek filtreler şu şekildedir: Sıvılaştırma, Ufuk Noktası, Ortalama Bulanıklaştırma, Bulanıklaştırma, Daha Fazla Bulanıklaştırma, Kutu Bulanıklaştırma, Gauss Bulanıklığı, Mercek Bulanıklığı, Hareket Bulanıklığı, Radyal Bulanıklık, Yüzey Bulanıklaştırma, Şekil Bulanıklığı, Mercek Düzeltmesi, Parazit Ekleme, Gürültüyü Temizleme, Toz ve Çizikler, Medyan, Parazit Azaltma, Lifler, Bulutlar, Fark Bulutları, Mercek Parlaması, Keskinleştirme, Kenarları Keskinleştirme, Daha Fazla Keskinleştirme, Akıllı Keskinleştirme, Keskinliği Azaltma Maskesi, Kabartma, Kenarları Bulma, Solarizasyon, Taramasız Hale Getirme, NTSC Renkleri, Özel, Yüksek Geçiş, Maksimum, Minimum ve Kaydırma."
  },
  {
    "soru numarası": 17,
    "soru cümlesi": "Aşağıdakilerden hangisi katman üzerinde yapılan işlemler arasında yer almaz?",
    "seçenekler": [
      "A) Katmanın yeniden boyutlandırılması",
      "B) Katmanın konumunun değiştirilmesi",
      "C) Katmanların ters çevrilmesi",
      "D) Katmanların birleştirilmesi",
      "E) Katmanların bağlanması"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Unite: 5 KATMAN ÜZERİNDE İŞLEMLER: Katmanın Konumun Değiştirilmesi - Taşınması, Katmanın Yeniden Boyutlandırılması, Katmanların Birleştirilmesi, Katmanların Bağlanması, Katmanların Tek Başına Kaydedilmesi, Katmanların Çoğaltılması"
  },
  {
    "soru numarası": 18,
    "soru cümlesi": "Aşağıdakilerden hangisi metin sınırlama kutusu işlemleri arasında yer almaz?",
    "seçenekler": [
      "A) Boyutlandırma",
      "B) Döndürme",
      "C) Eğriltme",
      "D) Yönlendirme",
      "E) Fontu eşleştirme"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 8 Metin sınırlama kutusu işlemleri: Boyutlandırma işlemi, Döndürme işlemi, Eğriltme işlemi, Yönlendirme işlemi, metin çarpıtma işlemi."
  },
  {
    "soru numarası": 19,
    "soru cümlesi": "Aşağıdakilerden hangisi Photoshop programında resmin çözünürlüğü hakkında doğru bir ifade değildir?",
    "seçenekler": [
      "A) Bir resmin ppi değeri ne kadar küçükse çözünürlüğü yani kalitesi de o kadar yüksektir.",
      "B) Photoshop’ta resimler genelde 300 ppi, 72 ppi veya 96 ppi olarak görüntülenmektedir.",
      "C) Baskı alınacak resimlerde baskı kalitesini artırmak için resmin 300 ppi gibi yüksek çözünürlükte olması gerekir.",
      "D) Photoshop’ta kullanım amacına göre resimlerin çözünürlük ayarlaması yapılabilmektedir.",
      "E) Düşük çözünürlük özelliğindeki bir kamerayla çekilmiş bir resmin çözünürlüğünü Photoshop’ta artırmak işe yaramaz."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 9 Bir resmin ppi değeri ne kadar büyükse çözünürlüğü yani kalitesi de o kadar yüksektir"
  },
  {
    "soru numarası": 20,
    "soru cümlesi": "Piksellerin (noktaların) birbirine ne kadar yakın olduğunu ifade eden kavram aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Çözünürlük",
      "B) Bitmap",
      "C) Vektör",
      "D) Bulanıklık",
      "E) Doygunluk"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 1 Bir görüntünün çözünürlüğü bize piksellerin (noktaların) birbirine ne kadar yakın olduğunu ifade eder."
  }
]