[
  {
    "soru numarası": 1,
    "soru cümlesi": "I. Eylemler, otomatik olarak yinelenen görevleri gerçekleştirerek zamandan tasarruf etmeyi sağlar. II. Aynı görüntü adımlarının birçok görüntüye uygulanması gerektiğinde eylemler kullanılabilir. III. Eylemler paneline ulaşmak için dosya menüsü kullanılır. Photoshop programında, eylemler ile ilgili olarak yukarıdakilerden hangisi ya da hangileri doğrudur?",
    "seçenekler": [
      "A) Yanlız I",
      "B) I ve II",
      "C) II ve III",
      "D) I ve III",
      "E) I, II ve III"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 12 Eylemler paneline pencere menüsünden ulaşılır. Diğer öncüller doğrudur."
  },
  {
    "soru numarası": 2,
    "soru cümlesi": "I. Kalem aracıyla çizilen eğri ve doğrulardan oluşan ana hatlara yollar denir. II. Yollar seçime dönüştürülebilir veya çeşitli renklerle doldurulabilir. III. Yollar paneli, üzerine kaydedilen yolların çalışılan görüntü üzerine hızlı bir şekilde uygulanması için kullanılan bir paneldir. Yukardaki ifadelerden hangisi ya da hangileri doğrudur?",
    "seçenekler": [
      "A) Yanlız I",
      "B) I ve II",
      "C) I ve III",
      "D) II ve III",
      "E) I, II ve III"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 10 Yollar, kalem aracıyla çizilen eğri ve doğrulardan oluşan ana hatlardır. Bu ana hatları seçime dönüştürebilir veya çeşitli renklerde doldurabilir veya kontur vererek ana hatlarının belirginleşmesini sağlayabilirsiniz. Kalem aracıyla çizilen her yol otomatik olarak Yollar panelinde Çalışma Yolu adı verilen bir yola kaydedilir. Yollar paneli, üzerine kaydedilen yolların çalışılan görüntü üzerine hızlı bir şekilde uygulanması için kullanılan bir paneldir. Yollar paneli açık olsun veya olmasın kalem aracı ile çizilen her yol buraya doğrudan kaydedilir."
  },
  {
    "soru numarası": 3,
    "soru cümlesi": "Photoshop programından çizmek istediğiniz bir yolu 45 derece ve katlarına göre çizmek istediğinizde aşağıdaki tuşlardan hangisine basılı tutmanız gerekmektedir?",
    "seçenekler": [
      "A) Alt",
      "B) Scrool Lock",
      "C) Shift",
      "D) Tab",
      "E) Caps Lock"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Unite: 10 Eğer eklemek istediğiniz noktaları 45 derece ve katlarıyla orantılı olarak oluşturmak istiyorsanız Shift tuşuna basılı tutmanız gerekmektedir."
  },
  {
    "soru numarası": 4,
    "soru cümlesi": "Aşağıdakilerden hangisi yaygın olarak kullanılan dijital resim formatları arasında yer almaz?",
    "seçenekler": [
      "A) JPG",
      "B) TIFF",
      "C) BITMAP",
      "D) GIF",
      "E) TGA"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 11 PNG dosya formatı kullanılan en yaygın resim formatlarından bir tanesidir. Bunun yanı sıra grafik tasarım alanında farklı türlerde dijital resim formatları da kullanılmaktadır. Bunlar arasında en yaygın olanları JPG (veya JPEG), BITMAP (BMP), TIFF ve GIF şeklinde sıralanabilir."
  },
  {
    "soru numarası": 5,
    "soru cümlesi": "İkon dosyalarının uzantısı aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) .ICO",
      "B) .GIF",
      "C) .SMG",
      "D) .TIFF",
      "E) .JPG"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 13 İkon dosyaları Windows işletim sistemindeki çeşitli klasörlerin ve yazılımların simgeleridir. Bu görseller Adobe Photoshop CC 2018 programı içerisinde doğrudan ikon (.ico) dosyası olarak kaydedilememektedir. Dosya menüsünden Farklı Kaydet seçildiğinde kayıt türü olarak “*.ico” dosyası türünde kayıt yapılmadığı görülmektedir."
  },
  {
    "soru numarası": 6,
    "soru cümlesi": "Aşağıdakilerden hangisi Adobe Photoshop CC 2018 programında görüntü üzerinde belirlenen bir alanı itmeyi, çekmeyi, yansıtmayı, büzmeyi ve şişirmeyi sağlayan filtreye verilen addır?",
    "seçenekler": [
      "A) Uyarlanabilir geniş açı",
      "B) Stilize etme filtresi",
      "C)  Sumi-e filtresi",
      "D) Sıvılaştırma filtresi",
      "E) Mürekkep ana hatları filtresi"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 7 Sıvılaştırma özelliği Photoshop programında, görüntüde belirlenen bir alanı itmeyi, çekmeyi, yansıtmayı, büzmeyi ve şişirmeyi sağlar. Sıvılaştırma filtresini kullanarak görüntü üzerinde sanatsal efektler oluşturabileceğiniz gibi görüntünün rötuşlanmasını da sağlayabilirsiniz."
  },
  {
    "soru numarası": 7,
    "soru cümlesi": "Photoshop programında resmi dönüştürme işlemleri ile ilgili olarak aşağıdakilerden hangisi yanlıştır?",
    "seçenekler": [
      "A) Resmin merkezinde yer alan referans noktasına göre resmi büyütmek ya da küçültmek için ölçeklendir komutu verilir.",
      "B) Resmi referans noktasının etrafında çevirmek için döndür komutu verilir.",
      "C) Resmi referans noktasına göre yatay ya da dikey olarak eğmek için yamuklaştır komutu verilir.",
      "D) Resmi istenilen bir yönde deforme etmek için perspektif komutu verilir.",
      "E) Resmin şeklini değiştirmek için çarpıt komutu verilir."
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 9 Resmi istenilen bir yönde deforme etmek için deforme et komutu verilir."
  },
  {
    "soru numarası": 8,
    "soru cümlesi": "Adobe Photoshop CC 2018 programında görüntülere hareket vermek için aşağıdaki panellerden hangisi kullanılmalıdır?",
    "seçenekler": [
      "A) Zaman çizelgesi",
      "B) Hareket",
      "C) Aksiyon",
      "D) Efektler",
      "E) Filtre"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 13 Zaman Çizelgesi aracılığıyla görüntüye hareket vermek için Kare Animasyon Oluştur seçeneği seçilir."
  },
  {
    "soru numarası": 9,
    "soru cümlesi": "Photoshop programında var olan veya oluşturan bir eylemi birden çok görsel üzerinde tek seferde uygulamak için aşağıdaki komutlardan hangisi kullanılmaktadır?",
    "seçenekler": [
      "A) Dosya / İçe Aktar",
      "B) Katman / Katmanları Grupla",
      "C) Dosya / Otomatikleştir / Toplu İş",
      "D) Seç / Katmanları Yalıt",
      "E) Görüntü / Görüntü Döndürme"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Unite: 12 Var olan veya oluşturan bir eylemi birden çok görsel üzerinde tek seferde uygulamak için Şekil 12.19’ da gösterildiği üzere Dosya / Otomatikleştir / Toplu İş seçeneği kullanılmaktadır. Toplu iş komutu bir eylemin otomatik ve toplu olarak bir dosya grubuna uygulanması sağlar."
  },
  {
    "soru numarası": 10,
    "soru cümlesi": ".............. görüntüdeki diğer tüm renkleri oluşturmak için çeşitli miktarlarda birleştirilen renkler kümesidir. Cümlede boş bırakılan yere aşağıdakilerden hangisi getirilmelidir?",
    "seçenekler": [
      "A) Renk derinliği",
      "B) Ton",
      "C) Doygunluk",
      "D) Renk",
      "E) Renk modu"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite:"
  },
  {
    "soru numarası": 11,
    "soru cümlesi": "................................; çalışılan dosya üzerinde tıklanılan yerden yatay veya dikey olarak bir metin satırının girilmesidir. Cümlede boş bırakılan yere aşağıdakilerden hangisi getirilmelidir?",
    "seçenekler": [
      "A) Satırsal metin işlemleri",
      "B) Tek metin ekleme",
      "C) Metin satırı ekleme",
      "D) Paragrafta metin ekleme",
      "E) Noktada yaz ekleme"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 8 Noktada yazı ekleme (girme); çalışılan dosya üzerinde tıklanılan yerden yatay veya dikey olarak bir metin satırının girilmesidir."
  },
  {
    "soru numarası": 12,
    "soru cümlesi": "Aşağıdakilerden hangisi resim üzerinde işlem yaparken öncelikli olarak göz önünde bulundurulmalıdır?",
    "seçenekler": [
      "A) Resmin çözünürlüğü",
      "B) Resmin boyutu",
      "C) Resmin renk ve tonlaması",
      "D) Resmin yönelimi",
      "E) Resmin kullanım amacına uygunluğu"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 9 Bir resim üzerinde işlem yaparken öncelikle resmin kullanım amacına uygunluğu değerlendirilmelidir."
  },
  {
    "soru numarası": 13,
    "soru cümlesi": "Aşağıdakilerden hangisi Adobe Photoshop CC 2018 programında görüntüler çok kanal moduna dönüştürülürken geçerli olan ilkelerden biri değildir?",
    "seçenekler": [
      "A) Katmanlar desteklenmez ve bu yüzden düzleştirilir.",
      "B) Orijinal görüntüdeki renk kanalları, dönüştürülen görüntüde spot renk kanallarına dönüşür.",
      "C) CMYK görüntü çok kanallı moda dönüştürüldüğünde siyan, macenta, sarı ve siyah spot renk kanalları oluşturulur.",
      "D) RGB görüntü çok kanallı moda dönüştürüldüğünde siyan, macenta ve sarı spot renk kanalları oluşturulur.",
      "E) RGB, CMYK veya Lab görüntüsünden bir kanalı silmek, katmanları düzleştirmeden otomatik olarak görüntüyü çok kanallı moda dönüştürür."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 6 Görüntüler Çok kanallı moduna dönüştürülürken şu ilkeler geçerlidir: • Katmanlar desteklenmez ve bu yüzden düzleştirilir. • Orijinal görüntüdeki renk kanalları, dönüştürülen görüntüde spot renk kanallarına dönüşür. • CMYK görüntü Çok kanallı moda dönüştürüldüğünde siyan,macenta, sarı ve siyah spot renk kanalları oluşturulur. • Dizinlenmiş renk modunda; görüntüdeki renkleri saklayan ve dizinleyen bir Renk Arama Tablosu (CLUT) kullanılır. • RGB görüntü Çok kanallı moda dönüştürüldüğünde siyan, macenta ve sarı spot renk kanalları oluşturulur. • RGB, CMYK veya Lab görüntüsünden bir kanalı silmek, katmanları düzleştirerek otomatik olarak görüntüyü Çok kanallı moda dönüştürür. • Çok kanallı bir görüntüyü dışa aktarmak için Photoshop DCS 2.0 formatında kaydedebilirsiniz."
  },
  {
    "soru numarası": 14,
    "soru cümlesi": "Photoshop programında bir metnin şeklini belli bir stile göre eğip bükmek için kullanılan metin sınırlama kutusu işlemi aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Boyutlandırma işlemi",
      "B) Eğriltme işlemi",
      "C) Yönlendirme işlemi",
      "D) Çarpıtma işlemi",
      "E) Döndürme işlemi"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 8 Hazırlanan tasarımlarda metnin bütünsel olarak şeklini eğip bükme işlemi metni çarpıtma olarak ele alınmaktadır. Metni çarpıtma işlemlerinin yapılabilmesi için Metin > Metni Çarpıt menüsü seçilir. Çarpıtma penceresinde uygun bir stil ayarı belirlendikten sonra eğilmek istenen yüzde değer Eğ ayarından yapılır. Ayrıca, bu pencerede Yatay ve Dikey Deformasyon ayarları yüzde olarak belirlenebilir."
  },
  {
    "soru numarası": 15,
    "soru cümlesi": "Adobe Photoshop programı ile ilgili olarak aşağıdakilerden hangisi yanlıştır?",
    "seçenekler": [
      "A) Adobe Photoshop’un son sürümü Creative Cloud 2015'tir.",
      "B) CC sürümünde yazılımın satın alınması mümkün değildir.",
      "C) Yazılımın ücretsiz deneme süresi 30 gündür.",
      "D) Adobe Photoshop piksel tabanlı resim işleme editörüdür.",
      "E) Adobe Photoshop'un dosya biçimi PSD’dir."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 2 Adobe Photoshop’un son sürümü Creative Cloud 2018'dir"
  },
  {
    "soru numarası": 16,
    "soru cümlesi": "Dosya boyutu 2 GB üzerinde olan Photoshop çalışma dosyalarının kaydedildiği ve büyük belge formatı olarak adlandırılan dosya uzantısı aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) PNG",
      "B) JPEG",
      "C) BMP",
      "D) TIFF",
      "E) PSB"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 11 Dosya boyutu 2 GB üzerinde olan Photoshop çalışma dosyalarının kaydedildiği ve büyük belge formatı olarak adlandırılan dosya uzantısı PSB dir."
  },
  {
    "soru numarası": 17,
    "soru cümlesi": "Aşağıdakilerden hangisi Adobe Photoshop CC 2018 programında gizli katmanlar dahil olmak üzere bütün katmanları birleştirerek resmin tek bir katman haline gelmesini sağlayan işlemdir?",
    "seçenekler": [
      "A) Görüneni birleştir",
      "B) Görüntüyü düzleştir",
      "C) Katmanları bağla",
      "D) Katmanları birleştir",
      "E) Katmanları çoğalt"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 5 Katmanlar panelinde herhangi bir katman üzerinde sağ tıklarsanız, var olan tüm katmanları birleştirip tek katman haline getirmek için 2 seçenek olduğunu göreceksiniz. Bunlardan ilki olan Görüneni Birleştir, gizli olmayan tüm katmanları tek bir katman yaparak birleştirir. Diğer seçenek olan Görüntüyü Düzleştir ise, tüm katmanları (gizli olsa bile) birleştirerek resmin tek bir katman haline gelmesini sağlar."
  },
  {
    "soru numarası": 18,
    "soru cümlesi": "Photoshop programında tasarım yapılan çalışma alanını kılavuz çizgilerine bölmek için kullanılan yeni kılavuz mizanpajı komutunun bulunduğu menü aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Görünüm",
      "B) Dosya",
      "C) Düzenle",
      "D) Pencere",
      "E) Seç"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 14 Klavuz çizgileri görünüm menüsünden eklenir."
  },
  {
    "soru numarası": 19,
    "soru cümlesi": "Photoshop programında bir arka plana renk verebilmek iç “Solid Renk” özelliğinin seçildiği menüye ulaşılan panelaşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Özellikler",
      "B) Yollar",
      "C) Karakter",
      "D) Katmanlar",
      "E) Kanallar"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 14 Katmana renk verebilmek için Katmanlar panelinde Şekil 14.1‘de gösterilen 1 nolu butona sağ tıklanır ve Solid Renk menüsü seçilir ve açılan renk kartelasından siyah tonda bir renk (#191919) seçilir."
  },
  {
    "soru numarası": 20,
    "soru cümlesi": "Adobe Photoshop CC 2018 programında dikdörtgen, oval, tek satır ve tek sütun seçimleri yapmaya olanak sağlayan araç aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Kement araçları",
      "B) İşaretleme araçları",
      "C) Hızlı seçim araçları",
      "D) Kırpma araçları",
      "E) Dilimleme araçları"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite:"
  }
]