[
  {
    "soru numarası": 1,
    "soru cümlesi": "API kullanımına ilk izin veren site aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Salesforce.com",
      "B) Amazon",
      "C) Twitier",
      "D) Flickr",
      "E) Foursquare  Cevap Açıklama: (A) 2. Aşağıdakilerden hangisi animasyon sırasında çeşitli noktalarda animasyon özellikleri için değerleri belirtir?",
      "A) @keyframes",
      "B) animation-name",
      "C) animation-duration",
      "D) animation-timing-function",
      "E) animation-iteration-count  Cevap Açıklama: (A) @keyframes, animasyon sırasında çeşitli noktalarda animasyon özellikleri için değerleri belirtir. 3. Aşağıdakilerden hangisi HTML dokümanlarının ilk satırına yazılan, tarayıcıya dokümanın tipini belirten bir ifadedir?",
      "A) language",
      "B) lang",
      "C) charset",
      "D) meta",
      "E) doctype  Cevap Açıklama: (E) Doctype, HTML dokümanlarının ilk satırına yazılan, tarayıcıya dokümanın tipini belirten bir ifadedir. 4. Aşağıdakilerden hangisi Meta etiketinin özelliklerinden biri değildir?",
      "A) Web sitesinin en başında yer alır.",
      "B) Basit HTML kodlarındandır.",
      "C) Web sitesi hakkında bilgi vermek, içerik ve başlıkları belirtmek gibi çeşitli amaçlarla kullanılabilir.",
      "D) Küresel alanda Meta Tag olarak isimlendirilir.",
      "E) Web sayfası ekranında görülür.  Cevap Açıklama: (E) Web sayfası ekranında görülmez. 5. Aşağıdaki HTML 5 etiketleri ve kullanım alanı eşleştirmelerinden hangisi yanlıştır?",
      "A) audio - Sayfa içine ses dosyasının eklenmesini sağlar.",
      "B) video - Sayfalar içinde içerik kısmını ayırmayı sağlar.",
      "C) time - Tarih bilgisinin yazılabileceği alanı belirtir.",
      "D) article - Makale gibi yazıların yazılabileceği alanı belirtir.",
      "E) header - Sitede tüm sayfalarda ortak bulunan logo, menü vb. gibi alanların yer aldığı üst bölümü belirtir.  Cevap Açıklama: (B) video - Sayfa içine video dosyasının eklenmesini sağlar. 6. Aşağıda bulunan HTML özel karakterlerinden hangisi web sayfasına boşluk eklemekte kullanılır?",
      "A) & nbsp;",
      "B) & amp;",
      "C) & copy;",
      "D) & lt;",
      "E) & apos;  Cevap Açıklama: (A) 7. Sınıf olmayan fakat sınıf gibi davranış gösteren seçicilere ne ad verilir?",
      "A) sınıf seçicileri",
      "B) kimlik seçiciler",
      "C) evrensel seçiciler",
      "D) basit seçiciler",
      "E) sözde sınıflar  Cevap Açıklama: (E) 8. Aşağıdakilerden hangisi sadece açık hâli yazılan etiketlerden biri değildir?",
      "A) < img >",
      "B) < meta >",
      "C) < link >",
      "D) < table >",
      "E) < input >  Cevap Açıklama: (D) , kapatılması gereken etiketlerden birisidir. 9. CSS özelliklerinden çok sütunlu düzen özelliği olan column-gap’ın açıklaması aşağıdakilerin hangisinde verilmiştir?",
      "A) Sütunların nasıl doldurulacağını belirtir.",
      "B) Çok sütunlu bir öğedeki sütunlar arasındaki boşluğu belirtir.",
      "C) Çok sütunlu bir öğedeki sütunların en uygun genişliğini belirtir.",
      "D) Çok sütunlu bir öğedeki sütun sayısını belirtir.",
      "E) Çok sütunlu bir düzende bir öğenin kaç sütuna yayılacağını belirtir.  Cevap Açıklama: (B) 10. Aşağıdakilerden hangisi en çok kullanılan API test aracıdır?",
      "A) Rest Assured",
      "B) Postman",
      "C) Tricentis Tosca",
      "D) Katalon Studio",
      "E) Jmeter  Cevap Açıklama: (B) En çok kullanılan Postman test aracındır. 2 11. Arama motoru sayfasında yer alan sonuçlarda üst sıraya çıkmak için yapılan işleme ne ad verilir?",
      "A) İndexleme",
      "B) Takip etme",
      "C) Arama motoru optimizasyonu",
      "D) Görüş alanı",
      "E) Mobil uyumu  Cevap Açıklama: (C) 12. Aşağıdakilerden hangisi API performansını ölçmek için iyi bir yoldur?",
      "A) API uygulaması",
      "B) API örneği",
      "C) API testi",
      "D) API kullanımı",
      "E) Canvas API  Cevap Açıklama: (C) 13. I. Kullanıcı memnuniyeti II. Arayüz Tasarımı III. Veri Tabanı işlemleri Yukarıdakilerden hangisi ya da hangileri bir web sitesinde front-end geliştiricinin ilgilendiği konular arasında yer alır?",
      "A) Yalnız I",
      "B) Yalnız II",
      "C) Yalnız III",
      "D) I ve II",
      "E) I, II ve III  Cevap Açıklama: (D) Veri Tabanı işlemleri, front-end geliştiricinin ilgilendiği konular arasında yer almaz. 14. Blog sayfası tasarladığınızı düşünün. Bu sayfada blog yazısının sağ kısmına anahtar kelimeler, yazı kategorisi ve yazar adı eklemek için kullanılan etiket aşağıdakilerden hangisidir?",
      "A) < aside >",
      "B) < article >",
      "C) < header >",
      "D) < footer >",
      "E) < p >  Cevap Açıklama: (A) Blog yazısının sağ kısmına anahtar kelimeler, yazı kategorisi ve yazar adı eklemek için  etiketi kullanılır. 15. Aşağıdakilerden hangisi tasarım sürecinin etkileri arasında yer almaz?",
      "A) Kullanıcı deneyimini etkiler.",
      "B) Front-end geliştirmede kullanılacak bileşenlerin seçimini etkiler.",
      "C) Üzerinde çalışılan web projesinin amacı ve kapsamını etkiler.",
      "D) Kullanıcı memnuniyet düzeyini etkiler.",
      "E) Sistem performansını etkiler.  Cevap Açıklama: (Iptal) 16. Sayfada gösterilecek resmin dosya yolunu belirtmek için hangi özellik kullanılır?",
      "A) alt",
      "B) href",
      "C) title",
      "D) class",
      "E) src  Cevap Açıklama: (E) 17. Aşağıdakilerden hangisi internet kavramı için kullanılamaz?",
      "A) Bilgisayar sistemlerini birbirine bağlar.",
      "B) İnternet ile “www” kavramları farklı anlama gelir.",
      "C) 1993 yılında kamunun kullanabileceği hâle gelmiştir.",
      "D) Sadece web sitelerine girmek için kullanılır.",
      "E) İlk yıllarında e-posta uygulaması yaygınlaşmıştır.  Cevap Açıklama: (D) 18. Aşağıdakilerden hangisi HTML ile ilgili doğru bir ifadedir?",
      "A) HTML bir programlama dilidir.",
      "B) HTML sadece metinsel ifadeleri barındırır.",
      "C) HTML'de açılan her etiket kapatılmak zorunda değildir.",
      "D) HTML standartları Dünya Çapında Ağ Konsorsiyumu (W3C) tarafından belirlenir.",
      "E) HTML’nin ilk versiyonu sadece çok seviyeli başlıklara sahiptir.  Cevap Açıklama: (D) HTML standartları Dünya Çapında Ağ Konsorsiyumu tarafından belirlenir. 19. I. Verilere erişebilen kullanıcılar belirlenebilir. II. Web sitesi içerikleri kolaylıkla organize edilebilir. III. Çeşitli ilişkiler kurularak karmaşa önlenebilir. Yukarıdakilerden hangisi ya da hangileri veri tabanının işlevleri arasında yer alır?",
      "A) Yalnız I",
      "B) Yalnız II",
      "C) Yalnız III",
      "D) I ve II",
      "E) I, II ve III  Cevap Açıklama: (E) Veri tabanı sayesinde verilere erişebilen kullanıcılar belirlenebilir, web sitesi içerikleri kolaylıkla organize edilebilir ve çeşitli ilişkiler kurularak karmaşa önlenebilir. 20. Aşağıdakilerden hangisi sayfa dilini belirlemek için <html> etiketine eklenen bir özelliktir?",
      "A) language",
      "B) lang",
      "C) charset",
      "D) doctype",
      "E) meta  Cevap Açıklama: (B) CEVAP ANAHTARI 1. A2. A3. E4. E5. B6. A7. E8. D9. B10. B11. C12. C13. D14. A15. Iptal16. E17. D18. D19. E20. B"
    ],
    "doğru cevap indeksi": null,
    "doğru cevap": "",
    "açıklama": ""
  }
]