[
  {
    "soru numarası": 1,
    "soru cümlesi": "HTML5 ile gelen API'ler ve görevleriyle ilgili olarak aşağıdaki eşleştirmelerden hangisi yanlıştır?",
    "seçenekler": [
      "A) Webstorage - İstemci bilgisayarına veri depolamayı tanımlar.",
      "B) Canvas - Ses ve görüntü oynatmayı tanımlar.",
      "C) Drag and drop - Sayfa içindeki nesnelere sürükle-bırak tanımlar.",
      "D) Print - Yazdırma desteği sağlar.",
      "E) Geolocation - Konum bilgisini tanımlar.  Cevap Açıklama: (B) canvas - Grafik çizmeyi sağlar. 2. Web sayfasına çift tırnak eklemek için kullanılan HTML özel karakteri aşağıdakilerden hangisidir?",
      "A) & times;",
      "B) & gt;",
      "C) & reg;",
      "D) & quot;",
      "E) & cent;  Cevap Açıklama: (D) quot, web sayfasına çift tırnak eklemek için kullanılır. 3. Herhangi bir etiket aşağıdaki karakterlerden hangisi ile biter?",
      "A) (",
      "B) [",
      "C) >",
      "D) <",
      "E) }  Cevap Açıklama: (C) 4. Aşağıdakilerden hangisi HTML5'te yer alan grafik ve medya etiketleri arasında yer almaz?",
      "A) < canvas >",
      "B) < header >",
      "C) < audio >",
      "D) < svg >",
      "E) < source >  Cevap Açıklama: (B) Sayfanın veya bir bölümün üst kısmını belirlerken kullanılır. 5. Boyut özellikleri ve açıklamaları ile ilgili olarak aşağıdakilerden hangisi yanlıştır?",
      "A) max-width: Bir ögenin maksimum genişliğini ayarlar.",
      "B) min-width: Bir ögenin minimum genişliğini ayarlar.",
      "C) width: Bir ögenin genişliğini ayarlar.",
      "D) height: Bir ögenin yüksekliğini ayarlar.",
      "E) min-height: Bir ögenin minimum genişliğini ayarlar.  Cevap Açıklama: (E) min-height - Bir ögenin minimum yüksekliğini ayarlar. 6. API kullanımına ilk izin veren site aşağıdakilerden hangisidir?",
      "A) Twitier",
      "B) Salesforce.com",
      "C) Foursquare",
      "D) Amazon",
      "E) Flickr  Cevap Açıklama: (B) 7. Aşağıdakilerden hangisi API kullanmanın avantajlarından biri değildir?",
      "A) Entegrasyon yoluyla oluşturulan projelerin başarılı olma olasılığı daha düşüktür.",
      "B) Kullanıcı ve müşteri dostu kolaylıklar sağlanabilir.",
      "C) Zor ve karmaşık görünen projelerin, içeriğinin iyi bir dilde tasarlanmasını ve uygulanmasını sağlar.",
      "D) Yazılımcının işini her zaman kolaylaştırır.",
      "E) Projede daha fazla fonksiyon için fırsatlar sağlar.  Cevap Açıklama: (A) Entegrasyon yoluyla oluşturulan projelerin başarılı olma olasılığı daha yüksektir. 8. I. Metinsel ve şekilsel biçimlendirmelere olanak tanıyan bir web teknolojisidir. II. Bir programlama dili değil, bir işaretleme dilidir. III. HTML ögelerinin istenilen şekilde görüntülenmesi için kullanılır. Yukarıdakilerden hangisi ya da hangileri CSS'nin özelliklerinden biridir?",
      "A) I ve III",
      "B) Yalnız I",
      "C) Yalnız II",
      "D) Yalnız III",
      "E) I, II ve III  Cevap Açıklama: (E) I, II ve III CSS ile ilgili doğrudur. CSS (Cascading Style Sheets – Basamaklı Stil Şablonları), HTML'ye ek olarak metin ve şekilsel biçimlendirmelere olanak tanıyan bir web teknolojisidir. CSS de tıpkı HTML gibi bir programlama dili değil bir işaretleme dilidir. CSS, bir HTML belgesine stil verme ve HTML ögelerinin istenilen şekilde görüntülenmesi için kullanılır. 2 9. Meta refresh etiketi ile ilgili aşağıdakilerden hangisi yanlıştır?",
      "A) Belirli bir süre sonunda sayfa yönlendirilmesi sağlanabilir.",
      "B) Web sayfasının yönlendirilmesi için kullanılabilir.",
      "C) Head kodları arasına yazılması gerekmektedir.",
      "D) Web sayfasının yenilenmesi için kullanılabilir.",
      "E) Güncellenmesi az olan sitelerin tercih etmesi gerekmektedir.  Cevap Açıklama: (E) 10. I. Web sitesinin en sonunda yer alır. II. Basit HTML kodlarındandır. III. Web sitesi hakkında bilgi vermek, içerik ve başlıkları belirtmek gibi çeşitli amaçlarla kullanılabilir. IV. Küresel alanda Meta Tag olarak isimlendirilir. Yukarıdakilerden hangisi ya da hangileri meta etiketi ile ilgili doğrudur?",
      "A) I, II ve IV",
      "B) Yalnız I",
      "C) II, III ve IV",
      "D) II ve III",
      "E) I ve II  Cevap Açıklama: (C) II, III ve IV doğrudur. I yanlıştır çünkü Web sitesinin en başında yer alır. 11. CSS dilinde içeriğin (metnin) altına, üstüne veya üzerine çizgi çekmeyi belirten özellik aşağıdakilerden hangisidir?",
      "A) Text-shadow",
      "B) Text-indent",
      "C) Text-overflow",
      "D) Text-align",
      "E) Text-decoration  Cevap Açıklama: (E) text-decoration: İçeriğin altına, üstüne veya üzerine çizgi çekmeyi belirtir. 12. Aşağıdakilerden hangisi web tarayıcılarının okuyup yorumlayabildiği bir etiket yapısına sahiptir?",
      "A) Javascript",
      "B) UI (User Interface)",
      "C) CSS (Cascading Style Sheets)",
      "D) HTML (Hyper Text Markup Language)",
      "E) UX (User Experience)  Cevap Açıklama: (D) 13. DOCTYPE tanımlaması hangi amaçla yapılır?",
      "A) Sayfaya ses ya da video eklemek için",
      "B) HTML türünü belirtmek için",
      "C) Css özelliğini kullanabilmek için",
      "D) Dil tanımlaması yapmak için",
      "E) Karakter kümesini belirtmek için  Cevap Açıklama: (B) 14. Aşağıdakilerden hangisi Oracle tarafından geliştirilmiş IDE'dir (Integrated Development Environment)?",
      "A) Komodo Edit",
      "B) Visual Studio Code",
      "C) NetBeans",
      "D) RJ TextEd",
      "E) NotePad++  Cevap Açıklama: (C) NetBeans, Oracle tarafından geliştirilmiş IDE’dir. 15. Aşağıdakilerden hangisi bir sitede tüm sayfalarda ortak bulunan telif hakkı bilgisi ve hızlı erişim linki gibi alanların yer aldığı alt bölümü belirten bir etiketir?",
      "A) footer",
      "B) time",
      "C) header",
      "D) section",
      "E) audio  Cevap Açıklama: (A) footer, sitede tüm sayfalarda ortak bulunan telif hakkı bilgisi, hızlı erişim linkleri vb. gibi alanların yer aldığı alt bölümü belirtir. 16. I. Kullanıcı deneyimini etkiler. II. Front-end geliştirmede kullanılacak bileşenlerin seçimini etkiler. III. Kullanıcı memnuniyet düzeyini etkiler. IV. Sistem performansını etkilemez. Yukarıdakilerden hangisi ya da hangileri tasarım süreci ile ilgili yanlıştır?",
      "A) I, II ve IV",
      "B) I ve III",
      "C) II ve III",
      "D) Yalnız IV",
      "E) I ve II  Cevap Açıklama: (D) Sistem performansını etkiler. 17. CSS animasyonları ile ilgili olarak aşağıdakilerden hangisi yanlıştır?",
      "A) CSS animasyonları, sayfaya daha fazla yük getirmeden dinamik, ilgi çekici içerik eklemek isteyen internet sayfaları için kullanılır.",
      "B) Bir ögenin bir veya daha fazla stil özelliğindeki bir değişikliği canlandırmaya ve ayrıca animasyonun çeşitli yönlerini kontrol etmeye olanak tanıyan bir CSS özelliğidir.",
      "C) CSS animasyonları ek kod (örn. JavaScript) veya medya (örn. GIF'ler) gerektirmez, her şey HTML ve CSS ile yapılır.",
      "D) Fazladan komut dosyaları gerektirdiklerinden, CSS animasyonları sayfaları oldukça yavaşlatır.",
      "E) Animasyonun daha fazla özelleştirmek için hız ve gecikme gibi özellikler de eklenebilir.  Cevap Açıklama: (D) Fazladan komut dosyaları gerektirmediklerinden, CSS animasyonlarının sayfaları yavaşlatmayı da önleyecektir. 3 18. Sürükleme ve bırakma işlemlerinin yapılacağı kutularda ........ ve ......... özelliklerinde metotlar çağırılmalı ve sürüklenecek olan elemanın ........ özelliği “true” olmalıdır. Cümlede boş bırakılan yerlere sırasıyla aşağıdakilerden hangisi getirilmelidir?",
      "A) ondrop - ondragover - draggable",
      "B) ondrop - draggable - ondragover",
      "C) ondragover - draggable - ondrop",
      "D) ondragover - ondrop - draggable",
      "E) draggable - ondragover - ondrop  Cevap Açıklama: (Iptal) 19. Alan adı uzantısı ve kullanım alanı ile ilgili olarak aşağıdaki eşleştirmelerinden hangisi yanlıştır?",
      "A) info - Bilgi siteleri için kullanılır.",
      "B) edu - Eğitim kurumları tarafından kullanılır.",
      "C) com - Ordu kuruluşları tarafından kullanılır.",
      "D) gov - Hükûmet kurumları tarafından kullanılır.",
      "E) jobs - İş ve işçi ilanları veren siteler için hazırlanmıştır.  Cevap Açıklama: (C) com - Genel ve ticari konularda kullanılır. 20. Aşağıdakilerden hangisi web tarayıcılarla ilgili yanlış bir ifadedir?",
      "A) Sadece bilgisayarlar üzerinde kullanılır.",
      "B) Görsel ve metinsel ögeleri görüntüler.",
      "C) Web sitelerinin görüntülenmesi için kullanılır.",
      "D) Dosya indirme yapılabilir.",
      "E) Kullanıcılar ile web sitesi arasında bağlantı kurar.  Cevap Açıklama: (A) CEVAP ANAHTARI 1. B2. D3. C4. B5. E6. B7. A8. E9. E10. C11. E12. D13. B14. C15. A16. D17. D18. Iptal19. C20. A"
    ],
    "doğru cevap indeksi": null,
    "doğru cevap": "",
    "açıklama": ""
  }
]