[
  {
    "soru numarası": 1,
    "soru cümlesi": "Topraktandır cümle beden, Nefsini öldür ölmeden, Böyle emretmiş yaradan, Sen kalemsin ben uç muyum? Bu dizelerde aşağıdaki ses olaylarından hangisi yoktur?",
    "seçenekler": [
      "A) Ünsüz benzeşmesi",
      "B) Ulama",
      "C) Ünlü daralması",
      "D) Ünlü düşmesi",
      "E) Ünsüz yumuşaması"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Türkçe sözcüklerde ince ve kalın şekilleri bulunan k, g, l ünsüzleri ince ünlülerin yanında ince, kalın ünlülerin yanında kalın okunur."
  },
  {
    "soru numarası": 2,
    "soru cümlesi": "Aşağıdakilerden hangisi ses dilinin çeşitli anlamlarından biri değildir?",
    "seçenekler": [
      "A) Eski bir tarihi ve geçmişi olan insan topluluğunun anlaşma vasıtası",
      "B) Belli bir çağın kelime dağarcığı ve söz dizimi",
      "C) Bir yörede yaşayan toplumun standart dilden şekilce ayrılmış dili",
      "D) Bir yazarın, şairin söyleyiş tarzı",
      "E) Meslek gruplarının anlaşma sistemi"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Dil; uzun zaman boyunca tarih, coğrafya, kültür, medeniyet ve toplumsal etkiler ile bütün toplumun kolektif şuurundan, heyecanından ve zekâsından doğmuştur. Fertien doğmuş olmakla birlikte zamanla ferdin malı olmaktan çıkmış, genelleşmiş ve belli biçimler kazanmıştır. Dolayısıyla fert, topluma ait olan bu müessese üzerinde istediği gibi tasarruf etme hakkını kaybetmiştir. Ona yalnızca bu dili konuşma hakkı verilmiştir. Sadece konuşma değil, kurallarına uygun olarak konuşma... Bir millete mensup olan hiç kimse ana dilini bozma, yanlış ve kötü kullanma hakkına sahip değildir."
  },
  {
    "soru numarası": 3,
    "soru cümlesi": "Türkiye Türklerinin yazı dili aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Erzurum ağzı",
      "B) Rize ağzı",
      "C) Kütahya ağzı",
      "D) Manisa ağzı",
      "E) İstanbul ağzı"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "- Bir ülkede bir yazı dili varken aynı ülkede birden fazla konuşma dili olabilir. - Konuşma dili doğaldır, yazı dili ise yapay bir dildir. - Yazı dilinde kurallara sıkı sıkıya uyulması gerekirken, konuşma dilinde kurallara çok fazla riayet edilmeyebilir. Zira konuşma dilinde önemli olan anlaşmaktır. - Yazı dilinin kullanım alanı ve etkisi konuşma diline göre daha geniştir. - Konuşma dili günlük hayatia farklılıklar arz ederken yazı dili değişmezdir."
  },
  {
    "soru numarası": 4,
    "soru cümlesi": "Türkçenin sondan eklemeli bir dil olması ona aşağıdakilerden hangisini kazandırmıştır?",
    "seçenekler": [
      "A) Kolay kelime ve kavram türetmeye yarar.",
      "B) Fiillerin cümlenin sonunda olmasını sağlar.",
      "C) Düzenli bir cümle dizilişine yarar.",
      "D) İki ünlünün kelime ortasında bulunmamasını sağlar.",
      "E) Kelime başında iki ünsüzün olmasını engeller."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": ""
  },
  {
    "soru numarası": 5,
    "soru cümlesi": "Aşağıdakilerden hangisinde “dil” kavramı diğerlerinden farklı anlamda kullanılmıştır?",
    "seçenekler": [
      "A) Tanzimat dili, Divan dili",
      "B) Gemici dili, tıp dili, argo",
      "C) Nedim’in dili, Yahya Kemal’in dili",
      "D) Çocuk dili, din dili",
      "E) Türk dili, İngiliz dili"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Dil; uzun zaman boyunca tarih, coğrafya, kültür, medeniyet ve toplumsal etkiler ile bütün toplumun kolektif şuurundan, heyecanından ve zekâsından doğmuştur. Fertien doğmuş olmakla birlikte zamanla ferdin malı olmaktan çıkmış, genelleşmiş ve belli biçimler kazanmıştır. Dolayısıyla fert, topluma ait olan bu müessese üzerinde istediği gibi tasarruf etme hakkını kaybetmiştir. Ona yalnızca bu dili konuşma hakkı verilmiştir. Sadece konuşma değil, kurallarına uygun olarak konuşma... Bir millete mensup olan hiç kimse ana dilini bozma, yanlış ve kötü kullanma hakkına sahip değildir. Dilin bu nitelikleri şu iki özellikle ilgilidir: • Bireysel şuur alanının dışında kalışı • Kendini bize doğuştan kabul etirmesi"
  },
  {
    "soru numarası": 6,
    "soru cümlesi": "Aşağıdaki atasözlerinin hangisinde mecazlı bir söyleyiş yoktur?",
    "seçenekler": [
      "A) Açık yaraya tuz ekilmez.",
      "B) Ay var yılı besler, yıl var ayı beslemez.",
      "C) Ak gün ağartır, kara gün karartır.",
      "D) Âlim unutmuş, kalem unutmamış.",
      "E) Dost ile ye iç, alışveriş etme."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "2"
  },
  {
    "soru numarası": 7,
    "soru cümlesi": "Türkçenin köklü bir dil olmasındaki temel etken aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Tarihî geçmişi ve farklı coğrafyalarda olan hâkimiyeti",
      "B) Sahip olduğu kelime sayısı",
      "C) Çok fazla değişmeyen yapısı",
      "D) Sondan eklemeli bir dil olması",
      "E) Çok fazla tamlama ve kelime grubuna sahip olması"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": ""
  },
  {
    "soru numarası": 8,
    "soru cümlesi": "Aşağıdakilerin hangisinde birleşik fiilin yazımı yanlıştır?",
    "seçenekler": [
      "A) Her şeyi kendine dert etme.",
      "B) Bu maçta da iki gol yedi.",
      "C) Hastayı başka yere nakil etiler.",
      "D) Bunu yapamayacağını zannediyordum.",
      "E) Bizi umutsuz günlere sevk eti."
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Türkçe sözcüklerde ince ve kalın şekilleri bulunan k, g, l ünsüzleri ince ünlülerin yanında ince, kalın ünlülerin yanında kalın okunur."
  },
  {
    "soru numarası": 9,
    "soru cümlesi": "Türk dili tarihinde en erken dönem, aşağıdaki adlandırmalardan hangisiyle yapılır?",
    "seçenekler": [
      "A) İlk Türkçe Dönemi",
      "B) Ana Türkçe Dönemi (Proto-Türkçe)",
      "C) Altay Dil Birliği Dönemi",
      "D) Eski Türkçe Dönemi",
      "E) Orta Türkçe Dönemi"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Altay Dil Birliği Dönemi"
  },
  {
    "soru numarası": 10,
    "soru cümlesi": "Eşyalarımın hepsi sahilde kaybolmuş. Altı çizili sözcükte görülen ses olayı aşağıdakilerin hangisinde verilmiştir?",
    "seçenekler": [
      "A) Oğlunu gencecik yaşta yitirmenin acısını yaşıyordu.",
      "B) Ona karşı hissetiği her şey biti.",
      "C) Beni hep sen mutlu etin.",
      "D) Sınavı kazanamadım zannetmiş.",
      "E) Sana kırgın olduğunu kabul etmelisin."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Türkçe sözcüklerde ince ve kalın şekilleri bulunan k, g, l ünsüzleri ince ünlülerin yanında ince, kalın ünlülerin yanında kalın okunur."
  },
  {
    "soru numarası": 11,
    "soru cümlesi": "Aşağıdaki cümlelerden hangisinde \"\"ağız\"\" sözcüğü deyim içinde kullanılmamıştır?",
    "seçenekler": [
      "A) Bizim yörenin ağız özellikleri sizin yöreye çok yakın.",
      "B) Sorduklarıma doğru cevap vermiyor, lafı ağzında geveliyordu.",
      "C) İlk önce geleceğini söyledi, sonra gelmemek için ağız yapmaya başladı.",
      "D) Arkadaşına çok kızmıştı ve \"\"Ağzını düzelt!\"\" diye onu ikaz ediyordu.",
      "E) Bunca yaptıklarından sonra ağzının payını aldı."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": ""
  },
  {
    "soru numarası": 12,
    "soru cümlesi": "Dil ile ilgili ilk sistematik düşüncelere aşağıdakilerden hangisinde rastlanır?",
    "seçenekler": [
      "A) Herakletios",
      "B) Hintli Yaska",
      "C) Demokritos",
      "D) Sokrat",
      "E) Aristo"
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Milatian 500 yıl önce yaşamış olan Hintli Yaska, Herakleitos’un çağdaşı Demokritos, Romalı Varro ve Donatus, dilin doğuşuyla ilgili çeşitli çalışmalar yapmışlardır. (Babil Kulesi Efsanesi görseli için bk. Şekil 1.1)"
  },
  {
    "soru numarası": 13,
    "soru cümlesi": "Orhun Kitabeleri ilk defa aşağıdakilerden hangisi tarafından okunmuştur?",
    "seçenekler": [
      "A) Strahlenberg",
      "B) Yardintsev",
      "C) Wilhelm Thomson",
      "D) Reşit Rahmeti Arat",
      "E) Muharrem Ergin"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": ""
  },
  {
    "soru numarası": 14,
    "soru cümlesi": "Aşağıdakilerden hangisinde Türkiye’de Altayistik bilim kolunda çalışma yapan bilim adamlarından üçü birlikte verilmiştir?",
    "seçenekler": [
      "A) Osman Fikri Sertkaya, Yavuz Kartiallıoğlu, Muharrem Ergin",
      "B) Ahmet Temir, Osman Nedim Tuna, Talat Tekin",
      "C) Osman Nedim Tuna, Osman Fikri Sertkaya, Hayati Develi",
      "D) Şinasi Tekin, Ahmet Temir, Muharrem Ergin",
      "E) Muharrem Ergin, Şinasi Tekin, Osman Fikri Sertkaya"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Ural-Altay dillerinin Altay dillerini oluşturan Türk, Moğol, Tunguz-Mançu dillerinin akrabalığını savunan, bu dillerin ortak bir kaynaktan geldiğine inanan ve bunu ortaya çıkarmaya çalışan teoriye Altay Dilleri Teorisi denir. Bu dillerin kültürel unsurlarını araştıran, inceleyen bilim koluna Altayistik, bununla uğraşan bilim adamına ise Altayist denir. Türkiye’de Altayistik bilim kolunda çalışma yapan bilim adamları şunlardır: Ahmet Temir, Osman Nedim Tuna ve Talat Tekin. Bu araştırmacılar içerisinde en fazla Altayistik çalışma yapan bilim adamı ise Talat Tekin’dir"
  },
  {
    "soru numarası": 15,
    "soru cümlesi": "Bir dilin bilinmeyen bir zamanda kendisinden ayrılan ve yeni bir dil olma yolu tutan kolu aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Şive",
      "B) Lehçe",
      "C) Ağız",
      "D) Fonem",
      "E) Dizim"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": ""
  },
  {
    "soru numarası": 16,
    "soru cümlesi": "I.Betimleyici işlev II.Toplumsal işlev III. Çağrı işlevi Yukarıdakilerden hangisi ya da hangileri Lyons’a göre dilin işlevlerindendir?",
    "seçenekler": [
      "A) Yalnız II",
      "B) I ve II",
      "C) I ve III",
      "D) II ve III",
      "E) I, II ve III"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Sayfa 6 paragraf 3 de yer almaktadır."
  },
  {
    "soru numarası": 17,
    "soru cümlesi": "Aşağıdakilerden hangisi Altay dillerinin ortak özelliklerinden biri değildir?",
    "seçenekler": [
      "A) Ünlü uyumu yoktur.",
      "B) Ünsüzlere göre ünlüler bakımından zengindir.",
      "C) Kelimeler çift ünsüzle başlamaz.",
      "D) Cinsiyet ayrımı gösteren ek bulunmaz.",
      "E) Anlatım dolayısıyla çekim, son eklerle sağlanır."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Altay dillerinin ortak özellikleri ise şu şekilde sıralanabilir: • Ünlü uyumları vardır. • Ünsüzlere göre ünlüler bakımından daha zengindir. • Kelimeler çift ünsüzle başlamaz. • Cinsiyet ayrımı gösteren ek bulunmaz. • Sayı sıfatlarından birinin bulunduğu sıfat tamlamalarında isim unsuru çoğul ek almaz. • Anlatım dolayısıyla çekim, son eklerle sağlanır. • Eylem tabanları emir, isim tabanları tekildir. • Genel olarak özne-tümleç-nesne-yüklem sırası vardır. • Tamlamalarda belirtilen unsur önde, belirtilen unsur ise sonda gelir."
  },
  {
    "soru numarası": 18,
    "soru cümlesi": "“Etmek, olmak” gibi yardımcı fiillerle birleşen sözcüklerde herhangi bir ses olayı meydana gelirse bu sözcükler birleşik yazılır. Aşağıdakilerden hangisinde bu kurala uymayan bir sözcük vardır?",
    "seçenekler": [
      "A) hissetmek",
      "B) kaybolmak",
      "C) fark etmek",
      "D) razı etmek",
      "E) keşf etmek"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Türkçe sözcüklerde ince ve kalın şekilleri bulunan k, g, l ünsüzleri ince ünlülerin yanında ince, kalın ünlülerin yanında kalın okunur."
  },
  {
    "soru numarası": 19,
    "soru cümlesi": "Aşağıdakilerden hangisi konuşma dili ve yazı dili arasındaki farklardan biri değildir?",
    "seçenekler": [
      "A) Yazı dili, lehçelerden veya ağızlardan birine göre şekillenirken konuşma dilinde böyle bir durum söz konusu değildir.",
      "B) Konuşma dili de yazı diliyle ilgili benzer kurallara tabidir. Örneğin yazı dilinde söylenen sözlerde bir yanlışlık yapıldığında bunu geriye dönüp düzeltmek zor olduğu gibi konuşma dilinde de böyledir.",
      "C) Bir milletin din, edebiyat ve ilim adamları yazı dilini zenginleştirir ve yazı dili belli ölçülerde konuşma dilinden farklılaşır.",
      "D) Konuşma dilinde, yanlış söylenen bir sözden ya da bir kelimenin yerli yerince kullanılmamasından doğan aksaklık geriye dönülerek düzeltilebilirken yazı dilinde bu mümkün olmaz.",
      "E) Konuşma dili, yazı dilinden bağımsız olarak gelişen ve kendisine mahsus kuralları olan farklı bir dildir."
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Cevap şıkkı B olarak güncellenmiştir."
  },
  {
    "soru numarası": 20,
    "soru cümlesi": "Türkçe, yapısı bakımından aşağıdaki dil gruplarından hangisinde yer alır?",
    "seçenekler": [
      "A) Tek heceli diller",
      "B) Eklemeli diller",
      "C) Çekimli diller",
      "D) Önden eklemeli diller",
      "E) İç-ekli diller"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": ""
  }
]