[
  {
    "soru numarası": 1,
    "soru cümlesi": ".............................. göndericinin düşünceleri, hisleri, ilkeleri, öncelikleri, ön yargıları hakkında anlatıcıya bilgi verir. Cümlede boş bırakılan yere aşağıdakilerden hangisi getirilmelidir?",
    "seçenekler": [
      "A) Betimleme işlevi",
      "B) Çağrı işlevi",
      "C) Toplumsal işlev",
      "D) Edebî işlev",
      "E) Anlatım işlevi"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 2 Anlatım işlevi; göndericinin düşünceleri, hisleri, ilkeleri, öncelikleri, ön yargıları ve geçmiş deneyimleri hakkında alıcıya bilgi veren işlevdir."
  },
  {
    "soru numarası": 2,
    "soru cümlesi": "Türklerin çok geniş bir coğrafyada, birçok milletle etkileşim hâlinde olması Türkçenin söz varlığıyla ilgili hangi sonucu ortaya çıkarmıştır?",
    "seçenekler": [
      "A) Kendi dilini güçlendirmesi",
      "B) Başka dilleri küçümsemesi",
      "C) Yeni kelime almaya kapalı olması",
      "D) Türkçe asıllı kelimelerin korunması",
      "E) Yerli kelimelerin yerine yabancı kelimelerin kullanılması"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 5 Yerli kelimelerin yerine yabancı kelimeler kullanılması."
  },
  {
    "soru numarası": 3,
    "soru cümlesi": "Aşağıdakilerden hangisi yazı dilinin özelliklerinden biri değildir?",
    "seçenekler": [
      "A)  Bir ülkede bir yazı dili vardır.",
      "B)  Konuşma diline göre yapay bir özelliği vardır.",
      "C)  Kuralları konuşma diline göre daha sıkıdır.",
      "D)  Etki alanı konuşmaya göre daha geniştir.",
      "E)  Bir yöreye, bölgeye has özellikler barındırabilir."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite:"
  },
  {
    "soru numarası": 4,
    "soru cümlesi": "Ete kemiğe büründüm, Yunus diye göründüm. Yukarıdaki mısrada kök durumunda kaç sözcük vardır?",
    "seçenekler": [
      "A) 1",
      "B) 2",
      "C) 3",
      "D) 4",
      "E) 5"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 7 Sıralı cümlede \"\"et\"\", \"\"kemik\"\" \"\"Yunus\"\" ve \"\"-de\"\" sözcükleri kök durumundadır."
  },
  {
    "soru numarası": 5,
    "soru cümlesi": "Aşağıdaki dizelerin hangisinde hem yapım hem de çekim eki almış bir sözcük vardır?",
    "seçenekler": [
      "A) Ne hasta bekler sabahı",
      "B) Yokluğunda buldum seni",
      "C) Bırak vehmimde gölgeni",
      "D) Gelme artık neye yarar",
      "E) Gelsen neye gelmesen neye yarar"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 7 \"\"yok-luk-un\"\" sözcük hem isimden isim yapan yapım eki hem de çekim eki almıştır."
  },
  {
    "soru numarası": 6,
    "soru cümlesi": "Aşağıdaki eserlerden hangisi Karahanlı Türkçesi ile yazılmamıştır?",
    "seçenekler": [
      "A) Kutadgu Bilig",
      "B) Divân-ı Hikmet",
      "C) Atabetü'l-Hakayık",
      "D) Dîvanü Lügati't- Türk",
      "E) Kısasü'l-Enbiya"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 3 Kısasü'l Enbiya Harezm Türkçesi ile yazılmıştır."
  },
  {
    "soru numarası": 7,
    "soru cümlesi": "Bir dilin bilinmeyen bir zamanda kendisinden ayrılan ve yeni bir dil olma yolu tutan kolu aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Şive",
      "B) Lehçe",
      "C) Ağız",
      "D) Fonem",
      "E) Dizim"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite:"
  },
  {
    "soru numarası": 8,
    "soru cümlesi": "Yeryüzündeki bütün diller doğadaki seslerin taklit edilmesiyle ortaya çıkmıştır. Görüşünü savunan dil doğuş teorisi aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Ünlem Teorisi",
      "B) İş Teorisi",
      "C) Yansıma Teorisi",
      "D) Kutsal Kaynak Teorisi",
      "E) Psikolojik Teori"
    ],
    "doğru cevap indeksi": 2,
    "doğru cevap": "C",
    "açıklama": "Unite: 1 Yansıma teorisine göre insan, çevresindeki ses ve hareketlerin etkisinde kalarak benzer ses ve hareketleri çıkarmayı denemiş ve dil (konuşma) yeteneğini kazanmıştır."
  },
  {
    "soru numarası": 9,
    "soru cümlesi": "I. Toplumların tarihsel belleğidir. II. Sosyal ve kültürel değerlerin taşıyıcısıdır. III. Birlik ve beraberliğin en temel simgesidir. Dil ile ilgili olarak yukarıdakilerden hangisi ya da hangileri doğrudur?",
    "seçenekler": [
      "A) Yalnız III",
      "B) I ve II",
      "C) I ve III",
      "D) II ve III",
      "E) I, II ve III"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 2 Sayfa 3 paragraf 5 de yer almaktadır."
  },
  {
    "soru numarası": 10,
    "soru cümlesi": "Aşağıdaki dillerden hangisi çekimli dillerden biri değildir?",
    "seçenekler": [
      "A) Rusça",
      "B) Latince",
      "C) İngilizce",
      "D) Arapça",
      "E) Çince"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 3 Çince tek heceli bir dildir. Tek heceli dillerde sözcüğe herhangi bir ek getirilmediğinden eklemeli dillerdeki eklerin rolü büyük oranda sözcüğün sırasıyla, işlev sözcükleriyle ve anlam ayırt edici değere sahip vurgu ve tonlamalarla işaretlenir."
  },
  {
    "soru numarası": 11,
    "soru cümlesi": "Aşağıdakilerden hangisi Türkçenin ses kurallarına göre şekillenmeyen yabancı kelimeler arasında yer alır?",
    "seçenekler": [
      "A) Mandıra",
      "B) Kilise",
      "C) Panayır",
      "D) Enflasyon",
      "E) Körfez"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 5 enflasyon"
  },
  {
    "soru numarası": 12,
    "soru cümlesi": "Aşağıdaki cümlelerin hangisinde ünlü düşmesiyle ilgili bir yazım yanlışı yapılmıştır?",
    "seçenekler": [
      "A) Çocuğun ağızı yara içinde kalmış.",
      "B) Adamın burnu çok kanamış.",
      "C) Çocuğun boynu tutulmuştu.",
      "D) Çocuk boyalarla alnını boyamıştı.",
      "E) Göğsündeki sızı günden güne artıyordu."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite:"
  },
  {
    "soru numarası": 13,
    "soru cümlesi": "I. Türkçede sayı sıfatlarından sonra gelen adlar çoğul eki almazlar. II. Türkçede önlük-artlık (kalınlık-incelik) ve düzlük-yuvarlaklık uyumları vardır. III. Türkçe, diğer Türk dilleriyle birlikte Altay dil ailesinin bir kolunu oluşturur. Yukarıdakilerden hangisi ya da hangileri Türkçenin genel özellikleri arasında yer alır?",
    "seçenekler": [
      "A) Yalnız I",
      "B) I ve II",
      "C) I ve III",
      "D) II ve III",
      "E) I, II ve III"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite:"
  },
  {
    "soru numarası": 14,
    "soru cümlesi": "Mevlana, \"\"Sen ne söylersen söyle, söylediğin karşındakinin anladığı kadardır.\"\" der. Bu veciz söz, dilin ............ işleviyle ilgilidir. Cümlede boş bırakılan yere aşağıdakilerden hangisi getirilmelidir?",
    "seçenekler": [
      "A) tarihsel",
      "B) çağrı",
      "C) toplumsal",
      "D) anlatım",
      "E) edebî"
    ],
    "doğru cevap indeksi": 1,
    "doğru cevap": "B",
    "açıklama": "Unite: 2 Dilin çağrı işlevi tamamen alıcıyla ilgili bir konudur. Burada önemli olan göndericinin iletiği mesajın alıcı üzerindeki etkisidir yani alıcı tarafından nasıl anlaşıldığıdır."
  },
  {
    "soru numarası": 15,
    "soru cümlesi": "Aşağıdakilerin hangisinde dilin temel işlevlerinden biri belirtilmemiştir?",
    "seçenekler": [
      "A) Bilgiyi araştırma ve açıklama işlevi",
      "B) İkna etme işlevi",
      "C) Söylemi yapılandırma işevi",
      "D) Sosyalleşme işlevi",
      "E) Yaratıcı düşünme işlevi"
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 1 Literatür incelendiğinde dilin temel altı işlevinden söz edilmektedir (Deniz ve çekici, 2021; Kocaman, 1983). Bu işlevler sırasıyla; 1. Bilgiyi araştırma ve açıklama işlevi 2. Tutumları/duyguları araştırma ve açıklama işlevi 3. İkna etme işlevi 4. Sosyalleşme işlevi 5. İletişim sorunlarını önleme ve telafi etme işlevi 6. Söylemi yapılandırma işlevi"
  },
  {
    "soru numarası": 16,
    "soru cümlesi": "Türkçeyi doğduğu yörenin ağzı ile edinen bir bireyin eğitim sürecinde ölçünlü (standart) Türkiye Türkçesini öğrendikten sonra kendi yöresine döndüğünde yöresel dil kullanması o yörede yaşayan insanlara dayanışma duygusu verebilir. Ölçünlü dil kullanması ise toplumsal mesafenin açılmış olduğu düşüncesini yansıtabilir. Bu durumda eğitimli birey için doğru davranış aşağıdakilerin hangisinde belirtilmiştir?",
    "seçenekler": [
      "A) Bağlama göre hareket etmelidir.",
      "B) Ölçünlü dil kullanmalıdır çünkü artık yöresindeki insanlardan farklıdır.",
      "C) Yöresel ağız tercih edilmelidir çünkü o yöreden geldiğini unutmamalıdır.",
      "D) Ölçünlü dil kullanmalıdır çünkü yöresine örnek olma sorumluluğu vardır.",
      "E) Yöresel dil tercih edilmelidir çünkü yöresel dilin geliştirilmesi gerekir."
    ],
    "doğru cevap indeksi": 0,
    "doğru cevap": "A",
    "açıklama": "Unite: 4 Kişilerin kullandığı dil bağlama göre değişebilir."
  },
  {
    "soru numarası": 17,
    "soru cümlesi": "Aşağıdakilerden hangisi Türkiye Türkçesinin ses özelliklerinden biri değildir?",
    "seçenekler": [
      "A) Türkiye Türkçesinde içinde \"\"j\"\" bulunan sözcükler Türkçe değildir.",
      "B) Türkiye Türkçesinde \"\"c, ğ, l, m, n, r, z\"\" sesleriyle sözcük başlamaz.",
      "C) Türkiye Türkçesinde \"\"b, c, d, g\"\" sesleri genellikle sözcüklerin sonunda bulunmaz.",
      "D) Türkçede şedde vardır.",
      "E) Türkçede çift ünsüz ile hece başlamaz."
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 6 Arap yazısında, bir ünsüzün iki kez okunması gerektiğini gösteren ve harfin üstüne konan işarete şedde denir. Türkçede şeddeli okunuş yoktur."
  },
  {
    "soru numarası": 18,
    "soru cümlesi": "Sözünü sakınarak, tartarak kullanmak güzel söz söyleme hastalığından daha değerli bir şeydir. Karşımızdaki kişiyi düşünerek konuşmak ise yerli yerinde söylenmiş derli toplu sözlerden yeğdir. Konuya girmeden önce sözü uzun uzun ağızda gevelemek can sıkar, bir şeyi damdan düşer gibi söylemek ise etkiyi azaltır. Bu parçada savunulan düşünce ile doğrudan ilgi kurulabilecek atasözü aşağıdakilerden hangisidir?",
    "seçenekler": [
      "A) Söz var, iş bitirir; söz var baş yitirir.",
      "B) Söz dediğin yaş deridir, nereye çekersen oraya gider.",
      "C) Sözü söyle alana, kulağında kalana.",
      "D) Bülbülün çektiği dili belasıdır.",
      "E) Sözünü bil pişir, ağzını der devşir."
    ],
    "doğru cevap indeksi": 4,
    "doğru cevap": "E",
    "açıklama": "Unite: 5 Çok düşünüp yerinde söylemek anlamına gelen \"\"Sözünü bil pişir; ağzında der devşir.\"\" atasözü bu sorunun doğru cevabıdır."
  },
  {
    "soru numarası": 19,
    "soru cümlesi": "Türkçede p, ç, t, k ünsüzleri ünlü ile başlayan bir ek aldıklarında b, c, d, ğ ünsüzlerine dönüşür. Aşağıdakilerden hangisi bu kurala uymaz?",
    "seçenekler": [
      "A) Dip",
      "B) Ağaç",
      "C) Yurt",
      "D) Türk",
      "E) Sokak"
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 6 Türk"
  },
  {
    "soru numarası": 20,
    "soru cümlesi": "Aşağıdaki altı çizili kelimelerden hangisi hâl eki almamıştır?",
    "seçenekler": [
      "A) Çanakkale Boğazı’ndan geçişler kapatıldı.",
      "B) Haberleri olduğunda buna çok üzülecekler.",
      "C) Eşyaları başkasına taşıƴlar.",
      "D) Nihayet yolculuk başladı.",
      "E) Yağmurlu havalarda şifayı kaptım."
    ],
    "doğru cevap indeksi": 3,
    "doğru cevap": "D",
    "açıklama": "Unite: 7 sayfa 18 paragraf 5 de yer almaktadır."
  }
]